<?php
/**
 * 重庆柯一网络有限公司 版权所有
 * 开发团队:柯一网络 柯一CMS项目组
 * 创建时间: 2018/5/6 23:18
 * 联系电话:023-52889123 QQ：563088080
 * 惟一官网：www.cqkyi.com
 */

return[

        // 验证码字符集合
        'codeSet'  => '0123456789',
        // 验证码字体大小(px)
       // 'fontSize' => 25,
        // 是否画混淆曲线
        'useCurve' => false,
        // 验证码图片高度
        //'imageH'   => 30,
        // 验证码图片宽度
       // 'imageW'   => 100,
        // 验证码位数
        'length'   => 4,
        'fontttf'  => '2.ttf',
        // 验证成功后是否重置
        'reset'    => true


];