/************************************************************************/
/*
Copyright 2017 wtulip Inc.
License GPL
Author:crazycooler
Description:简单的来说就是一个全局对象，也可以认为是全局容器
*/
/************************************************************************/

#pragma once
#include <QObject>
#include <QFile>

class MIniFile;

class MHttp;
class MSqldb;
class MKVdb;
class MDocdb;
class MDirDB;

#define INI_FILE_REL_PATH "/Fish-MD.ini"
#define WEB_FILE_REL_PATH "/md/md.html"
#define INFO_FILE_REL_PATH "/qmd.info"

class MGlobal
{
public:
	MGlobal();
	~MGlobal();
public:
	/************************************************************************/
	/* 
	实例化全局对象
	*/
	/************************************************************************/
	bool instance();

	/************************************************************************/
	/* 
	释放全局对象
	*/
	/************************************************************************/
	void uninstance();


	/************************************************************************/
	/* 
	获取工作路径
	*/
	/************************************************************************/
	const QString &getWorkPath();

	/************************************************************************/
	/* 
	获取ini配置文件对象
	*/
	/************************************************************************/
	MIniFile *getIniFile();

	/************************************************************************/
	/* 
	获取Http操作对象
	*/
	/************************************************************************/
	MHttp *getHttp();


	/************************************************************************/
	/* 
	以下三个都是sqlite数据库中的操作对象
	MKVdb  key-value的数据操作对象
	MDocdb  doc的数据操作对象
	MDirDB  dir的数据操作对象
	*/
	/************************************************************************/
	MKVdb *getKVDB();
	MDocdb *getDocDB();
	MDirDB *getDirDB();

	/************************************************************************/
	/* 
	获取和设置用户名
	*/
	/************************************************************************/
	QString getUserName();
	void setUserName(const QString &name);

	/************************************************************************/
	/* 
	获取日志文件
	*/
	/************************************************************************/
	QFile *getLogFile();

protected:
	/************************************************************************/
	/* 
	加载ini配置文件
	*/
	/************************************************************************/
	bool loadIni(const QString &workPath);

	/************************************************************************/
	/* 
	获取工作路径，内部调用函数
	*/
	/************************************************************************/
	QString checkWorkPath();

private:
	//工作路径
	QString m_workPath;
	//ini配置文件
	MIniFile *m_ini;
	//http操作对象
	MHttp *m_http;
	//sqlite数据库
	MSqldb *m_db;
	//用户名
	QString m_userName;
	//日志文件
	QFile *m_logFile;
};

