/************************************************************************/
/*
Copyright 2017 wtulip Inc.
License GPL
Author:crazycooler
Description:主界面tittle栏中，更新时会旋转的图标
*/
/************************************************************************/

#pragma once

#include <QLabel>

class MSpinLabel : public QLabel
{
	Q_OBJECT

public:
	MSpinLabel(QWidget *parent);
	~MSpinLabel();

	/************************************************************************/
	/* 
	时间事件
	*/
	/************************************************************************/
	virtual void timerEvent(QTimerEvent *event);

	/************************************************************************/
	/*
	窗口绘制事件
	*/
	/************************************************************************/
	virtual void paintEvent(QPaintEvent *event);

	/************************************************************************/
	/* 
	设置旋转图片
	@param strPixmap 图片资源路径
	@param size		 图片大小
	*/
	/************************************************************************/
	void setSpinImage(const QString &strPixmap,int size);

	/************************************************************************/
	/* 
	图片旋转的速度
	@param speed 每100ms 旋转的角度
	*/
	/************************************************************************/
	void setSpeed(int speed);

	/************************************************************************/
	/* 
	开始旋转
	@param delay 大于0 旋转这些时间后自动停止，否则一直旋转，知道调用stop
	*/
	/************************************************************************/
	void start(int delay = 0);

	/************************************************************************/
	/* 
	旋转停止函数
	*/
	/************************************************************************/
	void stop();

private:
	//时间ID
	int m_nTimerId;
	//旋转角度的累加
	int m_count;
	//图片大小，必须是正方形的
	int m_size;
	//旋转速度 每100ms旋转的角度
	int m_speed;
	//图片对象
	QPixmap *m_pixmap;
	//旋转延时
	int m_delayCount;
};
