<?php
// +----------------------------------------------------------------------
// | YFCMF [ WE CAN DO IT MORE SIMPLE]
// +----------------------------------------------------------------------
// | Copyright (c) 2016-2018 http://yfcmf.net All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: rainfer <rainfer520@qq.com>
// +----------------------------------------------------------------------

/**
 * 模块信息
 */
return [
    // 模块名[必填]
    'name'        => 'cms',
    // 模块标题[必填]
    'title'       => '门户',
    // 开发者[必填]
    'author'      => 'yfcmf',
    // 版本[必填],格式采用三段式：主版本号.次版本号.修订版本号
    'version'     => '1.0.0',
    // 模块简介
    'intro' => '门户模块',
    // 模块描述
    'description' => '门户模块',
    //后台顶部菜单url
    'nav_url'=> 'cms/AdminNews/index',
    'need_addon' => [
    ],
    'need_module' => [
    ],
    'tables' => [
    ]
];