<?php
// +----------------------------------------------------------------------
// | RXThink框架 [ RXThink ]
// +----------------------------------------------------------------------
// | 版权所有 2017~2019 南京RXThink工作室
// +----------------------------------------------------------------------
// | 官方网站: http://www.rxthink.cn
// +----------------------------------------------------------------------
// | Author: 牧羊人 <rxthink@gmail.com>
// +----------------------------------------------------------------------

//DES加解密KEY
define('API_KEY', 'IaRt5201');

return array(
	//'配置项'=>'配置值'
	
    //【加载扩展配置文件】
    'LOAD_EXT_CONFIG' => 'msgConfig',//扩展配置可以支持自动加载额外的自定义配置文件
    
    //【配置扩展函数文件】
    'LOAD_EXT_FILE' => '',//加载自定义公共函数文件
    
);