<?php

// Heading
$_['heading_title'] = 'فشل الدفع!';

// Text
$_['text_basket']   = 'سلة الشراء';
$_['text_checkout'] = 'اتمام الطلب';
$_['text_failure']  = 'فشل الدفع';
$_['text_message']  = '<p>توجد مشكلة اثناء عملية الدفع ولم يتم اتمام الطلب.</p>

<p>اسباب فشل عملية الدفع هي:</p>
<ul>
  <li>الرصيد لايكفي</li>
  <li>فشل التحقق من صحة عملية الدفع</li>
</ul>

<p>الرجاء اعادة محاولة اتمام الطلب باستخدام طريقة دفع أخرى.</p>

<p>اذا تكررت مشكلة الدفع الرجاء <a href="%s">الاتصال بنا</a> وتوضيح تفاصيل طلبك.</p>
';
