<?php

$lang['cat-00']	= '栏目分类';
$lang['cat-01']	= '附加字段';
$lang['cat-02']	= '发布房源';
$lang['cat-03']	= '批量添加栏目%s个';
$lang['cat-04']	= '发布';
$lang['cat-05']	= '顶级栏目';
$lang['cat-06']	= '栏目分类是模块内容的归类，可以在不同的栏目中设置附加字段，发布房源时会显示对应栏目的附加字段';
$lang['cat-07']	= '首字母';
$lang['cat-08']	= '栏目目录';
$lang['cat-09']	= '数据量';
$lang['cat-10']	= '上级栏目';

$lang['cat-11']	= '批量添加';
$lang['cat-12']	= '栏目列表';
$lang['cat-13']	= '格式: 栏目名称|栏目目录 [回车换行]，如果不填写栏目目录时，会自动用拼音代替';
$lang['cat-14']	= '栏目名称';
$lang['cat-15']	= '栏目的一个名称，如“国际新闻”、“饰品服装”等';
$lang['cat-16']	= '栏目目录确保唯一，用于url填充或者生成目录，如“china”等';
$lang['cat-17']	= 'a-z单个字母，不区分大小写';
$lang['cat-18']	= '缩略图';
$lang['cat-19']	= '选择栏目';
$lang['cat-20']	= '目标栏目id不存在';

$lang['cat-21']	= '可以将当前栏目的设置（含权限规则）同步到其他栏目中，按“CTRL”实现多选';
$lang['cat-22']	= '还没有选择栏目';
$lang['cat-23']	= '栏目(%s)不存在';
/**更新程序增加部分2015-07-02**/

$lang['cat-100']	= '同步发布到其他栏目';
$lang['cat-101']	= '栏目已经存在';
$lang['cat-102']	= '已选择的栏目';
$lang['cat-103']	= '已选择：';
$lang['cat-104']	= '修改内容时会同步更新其他外联文档';