<?php
namespace Thumb;
/**
 * 配置文件信息
 * @author seven <397109515@qq.com>
 * @copyright Copyright (c) 2014 seven studio
 */
class Config{
    /**
     * @const string 如果图片不存在 默认加载的图片 
     */
    const defaultImg =  'images/default.jpg';
    /**
     * @const json 允许的图片大小 {宽:高} 如果是false 那么就禁用这个选项 如果是0  那么就不限制
     */
    const seze =  '{"120":130}';
    
    /**
     * @const json percent 把图片等比缩小到原来的百分数 {第一个值,第二个值{可选}}
     ******************************************
     * 如果是false 那么就禁用这个选项
     * 一个一维数组 最大长度是2
     * 如果长度是1的情况下
     * 那么必须完全符合
     * 如果是2 那么可以设置一个区间
     * 大于第一个而小于第二个
     ******************************************
     */
    const percent = 0;
    
    /**
     * @const json adaptive 截取的尺寸  {宽:高} 
     ******************************************
     * 如果是false 那么就禁用这个选项
     * 如果是0 那么就不限制
     * 如果长度是1的情况下
     ******************************************
     */
    const adaptive = false;
    
    /**
     * @const json center 从图片的中心计算，截取宽 * 高的图片。单位px   {宽:高} 
     ******************************************
     * 如果是false 那么就禁用这个选项
     * 如果是0 那么就不限制
     * 如果长度是1的情况下
     ******************************************
     */
    const center = false;
    
    /**
     * @const json rotate 旋转图片
     ******************************************
     * 如果是false 那么就禁用这个选项
     * 一个一维数组 最大长度是2
     * 如果是0 那么就不限制
     * 如果长度是1的情况下
     * 那么必须完全符合
     * 如果是2 那么可以设置一个区间
     * 大于第一个而小于第二个
     ******************************************
     */
    const rotate = 0;

}