<pre>
    作为本应用程序开发商（以下简称“我们”）深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。
为了给您提供更准确、更有个性化的服务，我们会按照本隐私权政策的规定使用和披露您的个人信息。我们将以高度的
勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，我们不会将这些信息对外
披露或向第三方提供。同时会不定时更新隐私政策内容。 在您同意提供的服务使用协议之时，即视为您已经同意隐私
政策的全部内容，隐私策略属于应用服务使用协议不可分割的一部分。

请在使用我们的产品（或服务）前，仔细阅读并了解本《隐私权政策》。

一、适用范围

我们通过合法途径取得的用户个人数据。您了解并同意，以下信息不适用本隐私权政策；

• 您在使用我们提供的搜索服务时输入的关键字信息；

• 收集到的您在服务中发布的有关信息数据，包括但不限于参与活动、成交信息及评价详情；

• 违反法律规定或违反应用服务规则行为及已对您采取的措施；

二、信息使用

• 我们不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可，或该第三方和我
方（含关联公司）单独或共同为您提供服务，且在该服务结束后，其将被禁止访问包括其以前能够访问的所有这些资料;

• 我们亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何用户如从事上述活动，一经
发现，我们有权立即终止与该用户的服务协议;

• 为服务用户的目的，我们可能通过使用您的个人信息，向您提供您感兴趣的信息，包括但不限于向您发出产品和服务
信息，或者与我们的合作伙伴共享信息以便他们向您发送有关其产品和服务的信息（后者需要您的事先同意）。

三、信息披露

在如下情况下，我们将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息：

• 经您事先同意，向第三方披露；

• 为提供您所要求的产品和服务，而必须和第三方分享您的个人信息；

• 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；

• 如您出现违反中国有关法律、法规或者本服务协议或相关规则的情况，需要向第三方披露；

• 如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；

• 在应用中创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，我们有权决定向该
用户提供其交易对方的联络方式等必要信息，以促成交易的完成或纠纷的解决；

• 其它情况会根据法律、法规或者网站政策认为合适的披露；

四、信息存储和交换

我们收集的有关您的信息和资料将保存在本地及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、
地区或本应用收集信息和资料所在地的境外并在境外被访问、存储和展示；

五、信息安全

• 我们提供的帐号均有安全保护功能，请妥善保管您在应用服务中的相关信息。我们将通过对用户相关信息进行加密等
安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您注意在信息网络上不存在“完善
的安全措施”；

• 在使用我们的服务进行网上交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式
或者邮政地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是
重要信息发生泄露，请您立即联络我们的客服，以便我们采取相应措施；

六、我们如何处理儿童的个人信息

我们的产品和服务主要面向成人。如果没有父母或监护人的同意下，儿童不得进行相关操作。

对于经父母同意而收集儿童个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的
情况下使用或公开披露此信息。

七、本隐私权政策如何更新

我们可能适时会对本隐私权政策进行调整或变更，本隐私权政策的任何更新将以标注更新时间的方式公布在我们网站上，
除法律法规或监管规定另有强制性规定外，经调整或变更的内容一经通知或公布后的7日后生效。如您在隐私权政策调
整或变更后继续使用我们提供的任一服务或访问我们相关网站的，我们相信这代表您已充分阅读、理解并接受修改后的
隐私权政策并接受其约束。

八、如何联系我们

如果您对本隐私政策有任何疑问、意见或建议，请通过与我们联系。
</pre>
