<?php
/**----------------------------------------------------------------------
 * OpenCenter V3
 * Copyright 2014-2018 http://www.ocenter.cn All rights reserved.
 * ----------------------------------------------------------------------
 * Author: wdx(wdx@ourstu.com)
 * Date: 2018/9/14
 * Time: 10:46
 * ----------------------------------------------------------------------
 */

return [
    //状态对应文字
    'status_replace_str' => [
        '-1' => '删除',
        '0' => '禁用',
        '1' => '启用',
        '2' => '待审核'
    ],
    //管理分组类型
    'admin_group_type' => [
        '1' => '管理员',
        '2' => '程序猿',
        '3' => '销售人员',
        '4' => '运营人员'
    ],
    //用户注册类型
    'user_register_type' => [
        '1' => '用户名注册',
        '2' => '邮箱注册',
        '3' => '手机注册'
    ],
    //验证规则
    'mobile_regexp' => '/^(13[0-9]|14[579]|15[0-3,5-9]|16[6]|17[0135678]|18[0-9]|19[89])\d{8}$/',
    'email_regexp' => '/^[a-zA-Z0-9_.-]+@[a-zA-Z0-9-]+(\.[a-zA-Z0-9-]+)*\.[a-zA-Z0-9]{2,6}$/',
    //后台登录验证码
    'admin_login_captcha' => true,
    //用户行为处罚类型
    'user_action_punish_type' => [
        '1' => '警告并禁止',
        '2' => '强制退出登录',
        '3' => '封停账户',
        '4' => '封IP'
    ],
    //时间单位
    'time_unit' => [
        '1' => '秒',
        '2' => '分钟',
        '3' => '小时',
        '4' => '天',
        '5' => '周',
        '6' => '月',
        '7' => '年'
    ]

];