<?php

return [

    /**
     * PHP 实例名称
     *
     * 为每个PHP实例设置单独名称,方便统计查看
     * 不能超过20字符
     */
    'app_name' => 'php-test',

    /**
     * 控制采集概率
     *
     * 基于性能考虑,服务不会对每个请求进行采集分析,此参数可以控制采集概率
     *   
     *   * 0 - 100 之间的整数
     *   * 0   - 全部关闭
     *   * 100 - 全部开启
     */
    'collect_weight' => 100,

    /**
     * 是否记录CPU时间
     *
     * 设置这个常量后,会统计进程占用CPU时间
     * 开启这个选项后，大概性能下降一半
     * 如果对cpu耗时不是特别敏感的情况下，建议不要启用这个选项
     */
    'flags_cpu' => 1,

    /**
     * 是否统计内存情况
     *
     * 设置这个常量后，将会统计内存占用情况
     * 如果需要对内存使用情况进行分析的情况下,可以开启此配置
     * 开启此设置对性能影响不大
     */
    'flags_memory' => 1,

    'flags_no_builtins' => 0,

    /**
     * 客户端主动结束请求后收集脚本是否继续运行
     *
     * 开启此设置后会对业务代码造成轻微影响
     */
    'ignore_user_abort' => 1,

    'connection' => require __DIR__ . '/database.php',
];

