<?php
/*
+--------------------------------------------------------------------------
|   thinkask [#开源系统#]
|   ========================================
|   http://www.thinkask.cn
|   ========================================
|   如果有兴趣可以加群{开发交流群} 485114585
|   ========================================
|   更改插件记得先备份，先备份，先备份，先备份
|   ========================================
+---------------------------------------------------------------------------
 */

return [
    'adminmenu' => [
    	'name'=>'wx_menu_name',
        'ico'=>'fa-weixin',
        'url'=>'',
        'child'=>[
	         [
	        // 站点信息
	        'name'=>'wx_menu_name_auth',
	        'ico'=>'',
	        'url'=>'/wx/admin/auth',
	        'url_extra'=>'',
	        ],
	        [
	        // 站点信息
	        'name'=>'wx_menu_name_fun',
	        'ico'=>'',
	        'url'=>'/wx/admin/fun',
	        'url_extra'=>'',
	        ],
		]
       
    ]

];
