<?php
// +----------------------------------------------------------------------
// | RXThinkCMF框架 [ RXThinkCMF ]
// +----------------------------------------------------------------------
// | 版权所有 2017~2020 南京RXThinkCMF研发中心
// +----------------------------------------------------------------------
// | 官方网站: http://www.rxthink.cn
// +----------------------------------------------------------------------
// | Author: 牧羊人 <1175401194@qq.com>
// +----------------------------------------------------------------------

/**
 * 短信配置类
 */
return [
    // 阿里云短信
    'aliyunsms' => [
        'accessKeyId' => 'LTAIiiZGTbjvJRFJKHMAE',
        'accessKeySecret' => 'xkki8v10wV3uUx637mk4eNNykTaMzNFGH',
        'signName' => '研发中心',
        'templateCode' => 'SMS_18122342354',
        'templateParam' => '',
    ],
];