Repository: imfht/phpsourcecode
Catalog: ngo/os/typo3conf/l10n/ch/lang/ch.locallang_core.xlf
Languages: ch

source: TYPO3 Element Browser
ch: 元素浏览器

# alttext.suggestSearching
source: Searching...
ch: 搜索...

# buttons.clear
source: Clear
ch: 清除

# buttons.clipboard
source: Clipboard
ch: 剪贴板

# buttons.exit
source: Exit
ch: 退出

# buttons.logout
source: Logout
ch: 退出

# buttons.selMenu_modules
source: MODULES
ch: 模块

# cm.allowedFileExtensions
source: Allowed file extensions:
ch: 允许文件扩展：

# cm.branchActions
source: Branch Actions
ch: 批量操作

# cm.collapseBranch
source: Collapse Branch
ch: 折叠分支

# cm.copy
source: Copy
ch: 复制

# cm.copyFolder_into
source: Copy folder into
ch: 拷贝文件夹进

# cm.copyPage_after
source: Copy page after
ch: 拷贝当前页后

# cm.copyPage_into
source: Copy page into
ch: 拷贝进

# cm.copyPasteActions
source: Page Actions
ch: 页面操作

# cm.createNewRelation
source: Create new relation
ch: 创建新关系

# cm.createnew
source: Create new
ch: 创建新的

# cm.createnew.link
source: Create new %s
ch: 创建新 %s

# cm.cut
source: Cut
ch: 剪切

# cm.delete
source: Delete
ch: 删除

# cm.deselect
source: Deselect
ch: 取消选择

# cm.deselectto
source: Deselect to
ch: 取消选择到

# cm.edit
source: Edit
ch: 编辑

# cm.editMetadata
source: Edit Metadata of this file
ch: 编辑文件 Metadata

# cm.editcontent
source: Edit content
ch: 编辑内容

# cm.expandBranch
source: Expand Branch
ch: 扩展分支

# cm.hide
source: Hide
ch: 隐藏

# cm.info
source: Info
ch: 信息

# cm.more
source: More options...
ch: 更多选项...

# cm.moveFolder_into
source: Move folder into
ch: 移动文件夹进

# cm.movePage_after
source: Move page after
ch: 移动当前页后

# cm.movePage_into
source: Move page into
ch: 移动进

# cm.new
source: New
ch: 新建

# cm.offline
source: Turn offline
ch: 调整为离线

# cm.online
source: Turn online
ch: 调整为在线

# cm.open
source: Open
ch: 打开

# cm.pasteafter
source: Paste after
ch: 粘贴其后

# cm.pasteinto
source: Paste into
ch: 粘贴到

# cm.rename
source: Rename
ch: 重命名

# cm.replace
source: Replace
ch: 替换

# cm.save
source: Save
ch: 保存

# cm.select
source: Select
ch: 选择

# cm.selectto
source: Select to
ch: 选择到

# cm.tempMountPoint
source: Mount as treeroot
ch: 作为根安装

# cm.unhide
source: Unhide
ch: 取消隐藏

# cm.unzip
source: Unzip
ch: 解压

# cm.upload
source: Upload Files
ch: 上传文件

# cm.view
source: Show
ch: 显示

# csh_tooltip_loading
source: Loading help...
ch: 加载帮助中...

# db_new.php.after
source: after
ch: 之后

# db_new.php.inside
source: inside
ch: 内部

# db_new.php.pagetitle
source: New record
ch: 新记录

# donateWindow.button_disable
source: Never show again
ch: 不再显示

# donateWindow.button_donate
source: Donate now
ch: 现在捐赠

# donateWindow.button_postpone
source: Remind me later
ch: 随后再提醒

# donateWindow.title
source: TYPO3 donation notice
ch: 提示

# error.database_schema_mismatch
source: A SQL error occurred. This may indicate a schema mismatch between TCA and the database. Try running database compare in the Install Tool.
ch: 数据库错误，可能TCA和数据库模式不匹配。尝试在安装工具中运行数据库对比工具。

# error.database_schema_mismatch_title
source: Database Error
ch: 数据库错误

# error.formProtection.tokenInvalid
source: Validating the security token of this form has failed. Please reload the form and submit it again.
ch: 验证这个表单的安全令牌错误.请刷新本表单并提交。

# error.invalidEmail
source: "%s" is not a valid e-mail address.
ch: "%s" 不是有效的邮件地址

# extension.not.installed
source: Extension "%s" is not installed.
ch: 扩展"%s" 没有安装

# file_clipupload.php.warning
source: No upload-folder is found. You should create a TEMP-folder ("_temp_") in the root of one of your mounts first!
ch: 未找到上传文件夹.您应该首先在某一个安装的根目录中创建一个TEMP("_temp_")文件夹!

# file_clipupload.php.warning_head
source: Upload path error
ch: 上传路径错误

# file_edit.php.coundNot
source: This filetype cannot be edited.<br />The file must have an extension like:<br /><br /> <b>%s</b>
ch: 无法编辑此文件类型.<br />文件必须有一个后缀如:<br /><br /> <b>%s</b>

# file_edit.php.pagetitle
source: Edit
ch: 编辑

# file_edit.php.saveAndClose
source: Save and Close
ch: 保存并关闭

# file_edit.php.submit
source: Save
ch: 保存

# file_newfolder.php.folders
source: folders
ch: 文件夹

# file_newfolder.php.label_newfile
source: File name:
ch: 文件名:

# file_newfolder.php.label_newfolder
source: Folder
ch: 文件夹

# file_newfolder.php.newfile
source: Create new textfile
ch: 创建新的文本文件

# file_newfolder.php.newfile_submit
source: Create file
ch: 创建文件

# file_newfolder.php.newfolders
source: Create new folders
ch: 创建新文件夹

# file_newfolder.php.number_of_folders
source: Number of folders:
ch: 文件夹数量：

# file_newfolder.php.pagetitle
source: New file or folder
ch: 新文件或文件夹

# file_newfolder.php.submit
source: Create folders
ch: 创建文件夹

# file_rename.php.pagetitle
source: Rename
ch: 重命名

# file_rename.php.submit
source: Rename
ch: 重命名

# file_replace.php.browse
source: Browse
ch: 浏览

# file_replace.php.keepfiletitle
source: Keep the current filename?
ch: 保留当前文件名？

# file_replace.php.pagetitle
source: Replace
ch: 替换

# file_replace.php.selectfile
source: Select new file
ch: 选择新文件

# file_replace.php.submit
source: Replace
ch: 替换

# file_upload.actions.all.empty
source: Please choose
ch: 请选择

# file_upload.actions.all.label
source: Alternatively, choose a mass action:
ch: 可选，选择更多的操作：

# file_upload.actions.all.override
source: Overwrite all files
ch: 覆盖所有文件

# file_upload.actions.all.rename
source: Rename all files
ch: 重命名所有文件

# file_upload.actions.all.skip
source: Skip all files
ch: 忽略所有文件

# file_upload.actions.all.use_existing
source: Use existing files
ch: 使用已存在的文件

# file_upload.actions.override
source: Overwrite
ch: 覆盖

# file_upload.actions.rename
source: Rename
ch: 重命名

# file_upload.actions.skip
source: Skip the file
ch: 忽略这个文件

# file_upload.actions.use_existing
source: Use existing file
ch: 使用已存在的文件

# file_upload.button.cancel
source: Cancel
ch: 关闭

# file_upload.button.continue
source: Continue with selected actions
ch: 使用已选择的操作继续

# file_upload.dropzonehint.message
source: Drop your files here, or <u>click, browse & choose files</u>
ch: 拖放文件到这里，或者<u>点击, 浏览 & 选择文件 </u>

# file_upload.dropzonehint.title
source: Drag & drop to upload files
ch: 拖放以上传文件

# file_upload.existingfiles.description
source: Some files you wanted to upload exist already on the system. Please select what you want to do with each file.
ch: 你正要传的一些文件已经存在，请选择选个文件操作

# file_upload.existingfiles.title
source: Some files exist already
ch: 一些文件已经存在了

# file_upload.fileExtensionExpected
source: Upload failed! A file with "{0}" extension is expected!
ch: 上传失败，以 "{0}" 为后缀的不允许上传。

# file_upload.fileNotAllowed
source: Filename "{0}" is not allowed!
ch: 文件名 "{0}" 不允许!

# file_upload.header.action
source: Action
ch: 操作

# file_upload.header.originalFile
source: Original file
ch: 原始文件

# file_upload.header.uploadedFile
source: Uploaded file
ch: 已上传的文件

# file_upload.maxFileSizeExceeded
source: File "{0}" exceeds maximum file size of {1}!
ch: 文件"{0}" 超过了最大的文件大小 {1}!

# file_upload.overwriteExistingFiles
source: Shall existing files be overwritten?
ch: 已经存在的文件将被覆盖？

# file_upload.php.files
source: files
ch: 文件

# file_upload.php.number_of_files
source: Number of files:
ch: 文件数量：

# file_upload.php.pagetitle
source: Upload files
ch: 上传文件

# file_upload.php.submit
source: Upload files
ch: 上传文件

# file_upload.select-and-submit
source: Select & upload files
ch: 选择并上传文件

# file_upload.upload-finished
source: Upload complete! Filelist reloading...
ch: 上传完成！文件列表正在载入...

# file_upload.upload-in-progress
source: File upload in progress...
ch: 文件正在上传中...

# file_upload.uploadFailed
source: Upload of file "{0}" failed!
ch: 上传文件"{0}"失败！

# flushAllCachesDescription
source: Clear all caches, including frontend caches, and extension-specific caches. Compile-time caches / system caches that are needed for TYPO3 to run are not touched.
ch: 清除所有缓存，包括前台、扩展、编译时间缓存，包括系统运行触及不到的缓存。

# flushAllCachesTitle
source: Flush all caches
ch: 刷新所有缓存

# flushGeneralCachesDescription
source: Clear frontend and page-related caches, plus some backend-related caches.
ch: 清除前台、页面相关缓存，加上一些后台相关的缓存。

# flushGeneralCachesTitle
source: Flush general caches
ch: 刷新常规缓存

# flushPageCachesDescription
source: Clear frontend and page-related caches.
ch: 清除前台和页面相关缓存

# flushPageCachesTitle
source: Flush frontend caches
ch: 更新前台缓存

# flushSystemCachesDescription
source: Clear all system-related caches, including the class loader, localization and extension configuration file caches. Rebuilding this cache may take some time.
ch: 清除所有系统相关缓存、包括类、语言、扩展配置文件，重建缓存需要一些时间。

# flushSystemCachesTitle
source: Flush system caches
ch: 更新系统缓存

# labels._CONTROL_
source: Control
ch: 控制

# labels._LOCALIZATION_
source: Localization
ch: 定位

# labels._PATH_
source: Path
ch: 路径

# labels.addnew
source: Add new
ch: 添加新

# labels.allTables
source: [All tables]
ch: [全部表格]

# labels.allow
source: Allow
ch: 允许

# labels.author
source: Author:
ch: 作者:

# labels.automatic
source: Auto
ch: 自动

# labels.beUser
source: BE-User
ch: 后台用户

# labels.browse_db
source: Browse for records
ch: 浏览记录

# labels.browse_file
source: Browse for files
ch: 浏览文件

# labels.cancel
source: Cancel
ch: 取消

# labels.category
source: Category:
ch: 类别:

# labels.changeInOrig
source: Changed in original translation
ch: 在原始数据中更改

# labels.checkAll
source: Check all
ch: 选择所有

# labels.clear_cache
source: Clear cache for this page
ch: 清除此页面的缓存

# labels.clipInsert_db
source: Insert %s record(s) from the clipboard
ch: 从剪贴板插入%s记录

# labels.clipInsert_file
source: Insert %s file(s) from the clipboard
ch: 从剪贴板插入%s文件

# labels.clipboard.clear_clipboard
source: Clear clipboard
ch: 清理粘贴板

# labels.clipboard.delete_elements
source: Delete elements
ch: 删除元素

# labels.cliptabs
source: Clipboard #
ch: 剪贴板 #

# labels.cliptabs-name
source: Clipboard #%s (multi-selection mode)
ch: 粘贴板 #%s (多选模式)

# labels.close
source: Close
ch: 关闭

# labels.collapseTable
source: Collapse table
ch: 折叠表格

# labels.copymode
source: Copy items instead of moving them
ch: 复制条目代替移动条目

# labels.count
source: Quantity:
ch: 数量：

# labels.createNewPage
source: Create new %s
ch: 创建新 %s

# labels.createNewRecord
source: Create new %s on page "%s"
ch: 创建新 %s，在页面 "%s"

# labels.createNewRecordRootLevel
source: Create new %s on root level
ch: 创建新 %s，在根级别

# labels.csv
source: Download CSV file
ch: 下载CSV文件

# labels.days
source: days
ch: 天

# labels.deny
source: Deny
ch: 拒绝

# labels.depth_0
source: This page
ch: 此页面

# labels.depth_1
source: 1 level
ch: 1 层

# labels.depth_2
source: 2 levels
ch: 2 层

# labels.depth_3
source: 3 levels
ch: 3 层

# labels.depth_4
source: 4 levels
ch: 4 层

# labels.depth_infi
source: Infinite
ch: 无限

# labels.disableRTE
source: Disable Rich Text Editor (RTE)
ch: 禁用Rich Text编辑器(RTE)

# labels.editPage
source: Edit %s "%s"
ch: 编辑 %s "%s"

# labels.editRecord
source: Edit %s "%s" on page "%s"
ch: 编辑 %s "%s"，在页面 "%s"

# labels.editRecordNoTitle
source: Edit %s on page "%s"
ch: 编辑 %s 在页面 "%s"

# labels.editRecordRootLevel
source: Edit %s "%s" on root level
ch: 编辑%s "%s" 在根级别

# labels.enabled
source: Enabled
ch: 打开

# labels.endtime
source: End
ch: 结束

# labels.enterSearchLevels
source: This page|1 level down|2 levels down|3 levels down|4 levels down
ch: 本页|向下1层|向下2层|向下3层|向下4层

# labels.enterSearchString
source: Enter search term
ch: 搜索字符串:

# labels.expandAll
source: Expand all
ch: 扩展全部

# labels.expandTable
source: Expand table
ch: 扩展表格

# labels.feUser
source: FE-User
ch: 前台用户

# labels.fieldsChanged
source: There are unsaved changes in the form! Do you want to continue WITHOUT saving?
ch: 表单中有未被保存的更改! 您想不保存而继续吗?

# labels.fieldsMissing
source: The fields marked with an exclamation mark are not yet correctly filled in. Please complete them properly.
ch: 黄色感叹号标识出来的域没有被正确填入,请完整的完成它们.

# labels.findRecord
source: Find records
ch: 搜索记录：

# labels.generalOptions
source: General options:
ch: 常规选项:

# labels.generalOptions_more
source: General options (continued):
ch: 常规选项（继续）：

# labels.generalTab
source: General
ch: 普通

# labels.goBack
source: Go back
ch: 返回

# labels.hidden
source: Hidden
ch: 隐藏

# labels.holdDownCTRL
source: Important: Hold down the CTRL key while toggling elements in this list!
ch: 重要： 切换此表的元素时按住CTRL键！

# labels.items
source: Available Items
ch: 可用项目

# labels.label.limit
source: Limit
ch: 限制

# labels.label.searchString
source: Search term
ch: 搜索项

# labels.label.search_levels
source: Search levels
ch: 搜索级别

# labels.lockedRecord
source: The user '%s' began to edit this record %s ago.
ch: 用户'%s' 在%s之前开始编辑此记录.

# labels.lockedRecordUser
source: The %s '%s' began to edit this record %s ago.
ch: 用户 %s '%s' 开始编辑这条记录，在 %s 之前.

# labels.lockedRecordUser_content
source: The %s '%s' began to edit content on this page %s ago.
ch: 用户 %s '%s' 开始编辑这个内容，在 %s 之前.

# labels.lockedRecord_content
source: The user '%s' began to edit content on this page %s ago.
ch: 用户'%s'在%s之前开始编辑此页面上的内容.

# labels.makeBookmark
source: Create a bookmark to this page
ch: 创建书签到本页

# labels.makeShortcut
source: Create a shortcut to this page?
ch: 创建此页面的快捷方式?

# labels.menu
source: Menu:
ch: 菜单:

# labels.minutesHoursDaysYears
source: min| hrs| days| yrs| min| hour| day| year
ch: 分|时|天|年

# labels.move
source: Move this item
ch: 移动此项

# labels.move_down
source: Move selected items downwards
ch: 向下移动所选条目

# labels.move_to_bottom
source: Move selected items to bottom
ch: 将所选条目移至底部

# labels.move_to_top
source: Move selected items to top
ch: 将所选条目移至顶部

# labels.move_up
source: Move selected items upwards
ch: 向上移动所选条目

# labels.new
source: NEW
ch: 新建

# labels.new_section
source: Create new:
ch: 创建：

# labels.noEditPermission
source: Sorry, you didn't have proper permissions to perform this change.
ch: 对不起,您没有执行此更改的适当许可.

# labels.noMatchingValue
source: INVALID VALUE ("%s")
ch: 无效数值("%s")

# labels.noRTEfound
source: Notice: This field can only be edited with a Rich Text Editor. No editor is currently available or enabled.
ch: 注意：此域仅可用Rich Text编辑器编辑.当前无编辑器可用.

# labels.noRecordFound
source: No record found
ch: 没有发现记录

# labels.no_title
source: No title
ch: 无标题

# labels.normal
source: Normal (single record mode)
ch: 常规（单个记录模式）

# labels.note
source: Note:
ch: 注释:

# labels.openInNewWindow
source: Open in new window
ch: 在新窗口中打开

# labels.path
source: Path
ch: 路径

# labels.placeholder.override
source: Override "%s"?
ch: 覆盖 "%s"?

# labels.refresh
source: Reload the tree from server
ch: 刷新目录树

# labels.refreshList
source: Reload list from server
ch: 刷新列表

# labels.reload
source: Reload
ch: 重新加载

# labels.remainingCharacters
source: Remaining characters: {0}
ch: 还剩字符 : {0}

# labels.removeItem
source: Remove item
ch: 移除条目

# labels.remove_selected
source: Remove selected items
ch: 移去所选条目

# labels.resetFilter
source: Reset Filter
ch: 重设过滤器

# labels.revertSelection
source: Revert selection
ch: 还原选择

# labels.rootLevel
source: root level
ch: 根级别

# labels.search
source: Search
ch: 搜索

# labels.selected
source: Selected Items
ch: 已选项目

# labels.setAllCheckboxes
source: Select All Checkboxes
ch: 选中全部复选框

# labels.setFields
source: Set fields
ch: 设置域

# labels.show
source: Show
ch: 显示

# labels.showList
source: Show record list
ch: 显示记录列表

# labels.showPage
source: View webpage
ch: 查看网页

# labels.showRecords
source: Show records
ch: 显示记录

# labels.starttime
source: Start
ch: 开始

# labels.table
source: Table
ch: 表格

# labels.temporaryDBmount
source: Cancel temporary DB mount
ch: 取消临时加载的数据库

# labels.thumbmode_clip
source: Show Thumbnails on ClipBoard
ch: 显示剪贴板上的缩略图

# labels.title.limit
source: Limit
ch: 限制

# labels.title.search
source: Search
ch: 搜索

# labels.title.searchIcon
source: Toggle search toolbar
ch: 切换搜索条

# labels.title.searchString
source: Search term
ch: 搜索项

# labels.title.search_levels
source: Search levels
ch: 搜索级别

# labels.toggleall
source: Toggle all
ch: 切换所有

# labels.uncheckAll
source: Uncheck all
ch: 取消选择所有

# labels.unknownUser
source: -Unknown-
ch: -未知-

# labels.upOneLevel
source: Up one level
ch: 向上一层

# labels.user
source: User
ch: 用户

# link.to.dblist.correctly
source: Please, do not link to this page. Use \TYPO3\CMS\Backend\Utility\BackendUtility::getListViewLink() for link generation.
ch: 请不要链接到这个页面，可使用t3lib_BEfunc::getListViewLink() 来产生链接

# link.to.filefile.correctly
source: Please, do not link to this page.
ch: 请不要链接到此页面

# loadingIndicator
source: Loading ...
ch: 加载中...

# mess.be_locked
source: The TYPO3 backend is currently locked for maintenance. Leave this browser window open and the backend will automatically become available again once maintenance is complete.
ch: 因为维护后台已经锁定，保持浏览器打开状态，维护完毕后后台将自动可用

# mess.copy_after
source: Copy "%s" to after "%s"?
ch: 将"%s"复制到"%s"之后?

# mess.copy_into
source: Copy "%s" into "%s"?
ch: 将"%s"复制到"%s"中?

# mess.copycb_after
source: Copy all elements (%s) from the clipboard to the position after "%s"?
ch: 从剪贴板复制所有元素(%s)到"%s"之后的位置?

# mess.copycb_into
source: Copy all elements (%s) from the clipboard into "%s"?
ch: 从剪贴板复制所有元素(%s)到"%s"中?

# mess.delete
source: Are you sure you want to delete "%s"?
ch: 您确定要删除"%s"?

# mess.deleteClip
source: Are you sure you want to delete ALL referenced elements (%s) on the clipboard?
ch: 您确定要删除剪贴板中所有选中的元素(%s)?

# mess.login_about_to_expire
source: Your TYPO3 login is about to expire. Please confirm that you want to stay logged in.
ch: 登录已经过期，请确认你将保持登录

# mess.login_about_to_expire_title
source: TYPO3 login expiration notice
ch: 登录过期提示

# mess.login_expired
source: Your TYPO3 login has expired. You need to login again if you want to continue. Otherwise you can close the current browser window.
ch: 登录已经过期，你需要重新登录，否则请关闭此窗口

# mess.login_refresh_about_to_expire
source: Your TYPO3 login is about to expire. Please confirm that you want to be logged out.
ch: 你的登录要过期了，请确认你想要退出。

# mess.move_after
source: Move "%s" to after "%s"?
ch: 将"%s"移动到"%s"之后?

# mess.move_into
source: Move "%s" into "%s"?
ch: 将"%s"移动到"%s"中?

# mess.movecb_after
source: Move all elements (%s) from the clipboard to the position after "%s"?
ch: 从剪贴板移动所有元素(%s)到"%s"之后的位置?

# mess.movecb_into
source: Move all elements (%s) from the clipboard into "%s"?
ch: 从剪贴板移动所有元素(%s)到"%s"中?

# mess.noSelItemForEdit
source: Please select one or more items in the list before you can edit.
ch: 在您编辑前请在列表中选择一个或多个条目.

# mess.please_wait
source: Please wait ...
ch: 请等待...

# mess.redraw
source: Redrawing the page will discard the current data. Do you want to continue?
ch: 刷新页面将丢失当前数据. 您想继续吗?

# mess.refreshRequired.content
source: This change will affect which fields are available in the form. Would you like to save now in order to refresh the display?
ch: 这个变化将影响到表单中一些可用的字段，你希望保存并刷新这个界面吗？

# mess.refreshRequired.title
source: Refresh required
ch: 要求重新刷新

# mess.refresh_direct_logout_button
source: No, log out.
ch: No,退出

# mess.refresh_exit_button
source: Exit
ch: 退出

# mess.refresh_login
source: Your login has probably expired. Do you want to refresh it now?
ch: 您的登录可能已到期. 您想现在重新刷新吗?

# mess.refresh_login_button
source: Login
ch: 登录

# mess.refresh_login_countdown
source: {0} seconds
ch: {0} 秒

# mess.refresh_login_countdown_singular
source: {0} second
ch: {0} 秒

# mess.refresh_login_emptyPassword
source: Empty password is not allowed!
ch: 不允许空密码

# mess.refresh_login_failed
source: Login failed
ch: 登录失败

# mess.refresh_login_failed_message
source: Password not correct.
ch: 密码不正确

# mess.refresh_login_logging_in
source: Logging in...
ch: 登录...

# mess.refresh_login_logout_button
source: Log me out
ch: 让我退出

# mess.refresh_login_password
source: Password
ch: 密码

# mess.refresh_login_refresh_button
source: Stay logged in!
ch: 保持登录！

# mess.refresh_login_title
source: Refresh Login to TYPO3 (User: %s)
ch: 刷新

# mess.refresh_login_username
source: Username
ch: 用户名

# mess.refresh_logout_button
source: Logout
ch: 退出

# message.description.fileDeleted
source: The file "%s" was successfully deleted.
ch: 文件 "%s" 成功被删除。

# message.description.fileNotFound
source: The file %s is not found, possible already removed.
ch: 文件 "%s" 没有找到，可能已经被删除了。

# message.description.folderDeleted
source: The folder "%s" was successfully deleted.
ch: 文件夹 "%s" 成功被删除。

# message.description.folderNotDeletedHasFiles
source: The folder cannot be deleted since it still contains files.
ch: 文件夹不能被删除因为里面还有文件。

# message.header.fileDeleted
source: File deleted
ch: 文件已删除

# message.header.fileHasBrokenReferences
source: File has broken references
ch: 文件引用已损坏

# message.header.fileNotDeletedHasReferences
source: File not deleted
ch: 文件为删除

# message.header.fileNotFound
source: File not found
ch: 文件未发现

# message.header.folderDeleted
source: Folder deleted
ch: 文件夹删除

# message.header.folderNotDeletedHasFiles
source: Folder not deleted
ch: 文件夹未删除

# message.header.folderNotDeletedHasFilesWithReferences
source: Folder not deleted
ch: 文件夹未删除

# online_media.error.invalid_url
source: Unknown/not allowed URL
ch: 未知/不被允许的网址

# online_media.error.new_media.failed
source: Adding media failed
ch: 添加媒体失败

# online_media.new_media
source: Add new media asset
ch: 添加一个新的媒体

# online_media.new_media.added
source: Added media
ch: 添加媒体

# online_media.new_media.allowedProviders
source: Allowed media providers:
ch: 已允许的媒体提供者

# online_media.new_media.button
source: Add media by URL
ch: 按地址添加媒体

# online_media.new_media.label
source: Url of remote source:
ch: 远端资源的URL

# online_media.new_media.placeholder
source: Paste media url here...
ch: 粘贴媒体的网址到这里...

# online_media.new_media.submit
source: Add media
ch: 添加媒体

# rm.adminFunctions
source: Admin functions
ch: 管理功能

# rm.clearCacheMenu_all
source: Clear all caches
ch: 清理所有缓存

# rm.clearCacheMenu_allTypo3Conf
source: Clear configuration cache
ch: 清理配置缓存

# rm.clearCacheMenu_pages
source: Clear page content cache
ch: 清理页面缓存

# rm.clearCache_all
source: Clear FE cache
ch: 清除前台缓存

# rm.clearCache_allTypo3Conf
source: Clear cache in typo3conf/
ch: 清除typo3conf/中的缓存

# rm.clearCache_clearCache
source: Clear cache
ch: 清除缓存

# rm.clearCache_pages
source: Clear Page Cache
ch: 清除页面缓存

# rm.clearCache_thisPage
source: This page
ch: 此页面

# rm.closeAllDocs
source: Close all
ch: 关闭所有文档

# rm.closeDoc
source: Close
ch: 关闭文档

# rm.delete
source: Delete
ch: 删除

# rm.edit
source: Edit
ch: 编辑

# rm.export
source: Export
ch: 导出

# rm.menu
source: [menu]
ch: [菜单]

# rm.saveCloseAllDocs
source: Save and close all
ch: 保存并关闭所有文档

# rm.saveCloseDoc
source: Save and close
ch: 保存并关闭

# rm.saveDoc
source: Save
ch: 保存文档

# rm.saveDocShow
source: Save and view page
ch: 保存文档并查看页面

# rm.saveNewDoc
source: Save and create a new one
ch: 保存文档并创建一个新文档

# rm.translationSaveDoc
source: Translation finished, save and close
ch: 翻译完毕，保存并关闭

# rm.translationSaveDocClear
source: Translation NOT finished, Save
ch: 翻译未结束，保存

# show_item.php.cannotDisplayArchive
source: Sorry, TYPO3_CONF_VARS[BE][disable_exec_function] was set, so cannot display content of archive file.
ch: 对不起 TYPO3_CONF_VARS[BE][disable_exec_function] 没有设置，所以不能显示存档内容

# show_item.php.dimensions
source: Dimensions
ch: 尺寸

# show_item.php.field
source: Field:
ch: 字段：

# show_item.php.file
source: File
ch: 文件

# show_item.php.files
source: files
ch: 文件

# show_item.php.filesize
source: Size
ch: 大小

# show_item.php.ftp_area
source: FTP AREA
ch: FTP 区域

# show_item.php.missing_record
source: Missing
ch: 丢失

# show_item.php.pixels
source: Pixels
ch: 像素

# show_item.php.referencesFromThisItem
source: References from this item:
ch: 从这个项目引用：

# show_item.php.referencesToThisItem
source: References to this item:
ch: 引用到这个项目：

# show_item.php.sorting
source: Sorting:
ch: 排序：

# show_item.php.table
source: Table:
ch: 表格：

# show_item.php.title
source: Title:
ch: 标题：

# show_item.php.viewItem
source: View Item
ch: 查看条目

# sortable.dragmove
source: Drag to move
ch: 拖动以移动

# tabs.close
source: Close Tab
ch: 关闭标签

# tabs.closeAll
source: Close All Tabs
ch: 关闭所有标签

# tabs.closeOther
source: Close Other Tabs
ch: 关闭其它标签

# tabs.openInBrowserWindow
source: Open In Browser Window
ch: 在浏览器窗口中打开

# toolbarItems.bookmark
source: Bookmark
ch: 书签

# toolbarItems.bookmarks
source: Bookmarks
ch: 书签

# toolbarItems.bookmarksDelete
source: Delete bookmark
ch: 删除书签

# toolbarItems.bookmarksEdit
source: Edit bookmark
ch: 编辑书签
