Repository: imfht/phpsourcecode
Catalog: ngo/os/typo3conf/l10n/ch/lang/ch.locallang_core.xlf
Languages: ch

# toolbarItems.bookmarksGroup
source: Bookmark group
ch: 书签组

# toolbarItems.search
source: Search
ch: 搜索

# toolbarItems.shortcut
source: Shortcut
ch: 快捷方式

# toolbarItems.shortcuts
source: Shortcuts
ch: 快捷方式

# toolbarItems.shortcutsDelete
source: Delete Shortcut
ch: 删除快捷方式

# toolbarItems.shortcutsEdit
source: Edit Shortcut
ch: 编辑快捷方式

# toolbarItems.shortcutsGroup
source: Shortcut Group
ch: 快捷方式组

# toolbarItems.sysinfo
source: System Information
ch: 系统信息

# toolbarItems.sysinfo.applicationcontext
source: Application Context
ch: 应用环境

# toolbarItems.sysinfo.database
source: Database
ch: 数据库

# toolbarItems.sysinfo.gitrevision
source: GIT Revision
ch: GIT修订

# toolbarItems.sysinfo.operatingsystem
source: Operating System
ch: 操作系统

# toolbarItems.sysinfo.phpversion
source: PHP Version
ch: PHP版本

# toolbarItems.sysinfo.webserver
source: Webserver
ch: 网页服务器

# toolbarItems.workspace
source: Workspace
ch: 工作空间

# tree.activeFilterMode
source: Active Filtering Mode
ch: 激活过滤模式

# tree.buttonFilter
source: Filter tree
ch: 过滤页面

# tree.buttonNewNode
source: Create new pages
ch: 创建新页面

# tree.copyHint
source: Press Ctrl to copy.
ch: 按住Ctrl拷贝

# tree.defaultPageTitle
source: [Default Title]
ch: [默认标题]

# tree.dropToRemove
source: Drop here to delete
ch: 拖动这里删除

# tree.dropZoneElementRemoved
source: Click here to undelete
ch: 点击这里撤销删除

# tree.dropZoneElementRestored
source: Page restored
ch: 页面恢复

# tree.searchTermInfo
source: Enter search term
ch: 输入搜索词

# ver.mgm
source: Version Management
ch: 版本管理

# ver.online
source: ONLINE
ch: 在线

# ver.selVer
source: Select version:
ch: 选择版本：

# ver.swap
source: Swap/Publish
ch: 交换/公布

# ver.swapPage
source: Publish this version of the page including content
ch: 公布该页面版本,包括内容

# warning.backend_admin
source: The default backend user "admin" with password "password" is still present. %sEdit this account%s, either deleting it completely or changing the username and password.
ch: 后台默认用户”admin“和密码"password"仍旧未改变，%s编辑账户%s，删除或者更改用户名和密码。

# warning.file_missing
source: File is missing!
ch: 文件丢失了

# warning.header
source: Important Notice!
ch: 重要提示！

# warning.install_password
source: The Install Tool is still using the default password "joh316". Update this within the %sAbout section%s of the Install Tool.
ch: 安装密码默认为"joh316",可在安装工具中更改
