Repository: imfht/phpsourcecode
Catalog: ngo/os/typo3conf/l10n/ch/lang/ch.locallang_tca.xlf
Languages: ch

# TSconfig_title
source: TSconfig QuickReference
ch: TSconfig 快速参考

# allowed_languages
source: Limit to languages:
ch: 限制到语言：

# be_groups
source: Backend usergroup
ch: 后台用户组

# be_groups.custom_options
source: Custom module options:
ch: 自定义模块选项：

# be_groups.explicit_allowdeny
source: Explicitly allow/deny field values:
ch: 明确允许/拒绝字段值：

# be_groups.file_permissions.files
source: Files:
ch: 文件：

# be_groups.file_permissions.files_add
source: Files: Add
ch: 文件：添加

# be_groups.file_permissions.files_copy
source: Files: Copy
ch: 文件：拷贝

# be_groups.file_permissions.files_delete
source: Files: Delete
ch: 文件：删除

# be_groups.file_permissions.files_edit
source: Files: Edit
ch: 文件：编辑

# be_groups.file_permissions.files_move
source: Files: Move
ch: 文件：移动

# be_groups.file_permissions.files_read
source: Files: Read
ch: 文件：读

# be_groups.file_permissions.files_rename
source: Files: Rename
ch: 文件：更名

# be_groups.file_permissions.files_write
source: Files: Write
ch: 文件：写

# be_groups.file_permissions.folder
source: Directory:
ch: 目录：

# be_groups.file_permissions.folder_add
source: Directory: Add
ch: 目录：添加

# be_groups.file_permissions.folder_copy
source: Directory: Copy
ch: 目录：拷贝

# be_groups.file_permissions.folder_delete
source: Directory: Delete
ch: 目录：删除

# be_groups.file_permissions.folder_move
source: Directory: Move
ch: 目录：移动

# be_groups.file_permissions.folder_read
source: Directory: Read
ch: 目录：读

# be_groups.file_permissions.folder_recursivedelete
source: Directory: Delete recursively
ch: 目录：递归删除

# be_groups.file_permissions.folder_rename
source: Directory: Rename
ch: 目录：更名

# be_groups.file_permissions.folder_write
source: Directory: Write
ch: 目录：写

# be_groups.fileoper_perms
source: Fileoperation permissions:
ch: 文件操作权限：

# be_groups.fileoper_perms_diroper_perms
source: Directory: Move,Delete,Rename,New
ch: 目录：移动，删除，改名，新建

# be_groups.fileoper_perms_diroper_perms_copy
source: Directory: Copy
ch: 目录：拷贝

# be_groups.fileoper_perms_diroper_perms_delete
source: Directory: Delete recursively (rm -Rf)
ch: 目录：递归删除（rm-Rf）

# be_groups.fileoper_perms_general
source: Files: Upload,Copy,Move,Delete,Rename,New,Edit
ch: 文件：上传，拷贝，移动，删除，改名，新建，编辑

# be_groups.fileoper_perms_unzip
source: Files: Unzip
ch: 文件：解压

# be_groups.hide_in_lists
source: Hide in lists:
ch: 在列表中隐藏

# be_groups.inc_access_lists
source: Include Access Lists:
ch: 包括访问列表：

# be_groups.non_exclude_fields
source: Allowed excludefields:
ch: 允许可执行字段：

# be_groups.pagetypes_select
source: Page types:
ch: 页面类型：

# be_groups.subgroup
source: Inherit settings from groups:
ch: 子用户组：

# be_groups.tables_modify
source: Tables (modify):
ch: 表（修改）：

# be_groups.tables_select
source: Tables (listing):
ch: 表（列表）：

# be_groups.tabs.base_rights
source: Access Lists
ch: 访问列表

# be_groups.tabs.extended
source: Extended
ch: 扩展

# be_groups.tabs.mounts_and_workspaces
source: Mounts and Workspaces
ch: 加载点和工作空间

# be_groups.tabs.options
source: Options
ch: 选项

# be_groups.title
source: Grouptitle:
ch: 组标题：

# be_users
source: Backend user
ch: 后台用户

# be_users.admin
source: Admin(!):
ch: 管理员（！）：

# be_users.disableIPlock
source: Disable IP lock for user:
ch: 禁止此用户IP锁定

# be_users.file_permissions.file_delete
source: Files: Delete
ch: 文件：删除

# be_users.file_permissions.files
source: Files:
ch: 文件：

# be_users.file_permissions.files_add
source: Files: Add
ch: 文件：添加

# be_users.file_permissions.files_copy
source: Files: Copy
ch: 文件：拷贝

# be_users.file_permissions.files_move
source: Files: Move
ch: 文件：移动

# be_users.file_permissions.files_read
source: Files: Read
ch: 文件：读

# be_users.file_permissions.files_rename
source: Files: Rename
ch: 文件：更名

# be_users.file_permissions.files_write
source: Files: Write
ch: 文件：写

# be_users.fileoper_perms
source: Fileoperation permissions:
ch: 文件操作权限：

# be_users.fileoper_perms_diroper_perms
source: Directory: Move,Delete,Rename,New
ch: 目录：移动，删除，改名，新建

# be_users.fileoper_perms_diroper_perms_copy
source: Directory: Copy
ch: 目录：拷贝

# be_users.fileoper_perms_diroper_perms_delete
source: Directory: Delete recursively (rm -Rf)
ch: 目录：递归删除（rm-Rf）

# be_users.fileoper_perms_general
source: Files: Upload,Copy,Move,Delete,Rename,New,Edit
ch: 文件：上传，拷贝，移动，删除，改名，新建，编辑

# be_users.fileoper_perms_unzip
source: Files: Unzip
ch: 文件：解压

# be_users.lang
source: Default Language:
ch: 默认语言

# be_users.options
source: Mount from groups:
ch: 从组加载：

# be_users.options_db_mounts
source: DB Mounts:
ch: 数据库加载点：

# be_users.options_file_mounts
source: File Mounts:
ch: 文件加载点：

# be_users.password
source: Password:
ch: 密码：

# be_users.tabs.access
source: Access
ch: 访问

# be_users.tabs.extended
source: Extended
ch: 扩展

# be_users.tabs.mounts_and_workspaces
source: Mounts and Workspaces
ch: 加载点和工作空间

# be_users.tabs.options
source: Options
ch: 选项

# be_users.tabs.rights
source: Access Rights
ch: 访问权限

# be_users.usergroup
source: Group:
ch: 组：

# be_users.usergroup_add_title
source: Create new group
ch: 创建新组

# be_users.usergroup_edit_title
source: Edit usergroup
ch: 编辑用户组

# be_users.usergroup_list_title
source: List groups
ch: 列出组

# be_users.username
source: Username:
ch: 用户名：

# category_perms
source: Category Mounts:
ch: 分类加载点：

# db_mountpoints
source: DB Mounts:
ch: 数据库加载点：

# doktype.I.0
source: Standard
ch: 标准

# doktype.I.1
source: SysFolder
ch: 系统文件夹

# doktype.I.2
source: Recycler
ch: 回收站

# doktype.I.folder
source: Folder
ch: 文件夹

# editlock
source: Restrict editing by non-Admins:
ch: 非管理员有限编辑

# file_mountpoints
source: File Mounts:
ch: 文件加载点：

# file_mountpoints_add_title
source: Create new filemount
ch: 创建新的文件加载点

# file_mountpoints_edit_title
source: Edit filemount
ch: 编辑文件加载点：

# file_mountpoints_list_title
source: List filemounts
ch: 列出加载点

# is_siteroot
source: Is root of website:
ch: 为网站根目录:

source: Lock to domain:
ch: 锁定到域名：

# pages
source: Page
ch: 页面

# php_tree_stop
source: Stop page tree:
ch: 终止页面树:

# storage_pid
source: General Record Storage page:
ch: 一般记录存储页:

# sys_category
source: Category
ch: 分类

# sys_category.categories
source: Categories
ch: 分类

# sys_category.description
source: Description
ch: 描述

# sys_category.items
source: Items
ch: 项目

# sys_category.parent
source: Parent
ch: 父

# sys_category.tabs.category
source: Categories
ch: 分类

# sys_category.tabs.items
source: Items
ch: 项目

# sys_category.title
source: Title
ch: 标题

# sys_collection
source: Record Collection
ch: 记录集合

# sys_collection.description
source: Description
ch: 描述

# sys_collection.items
source: Items
ch: 项目

# sys_collection.table_name
source: Record Type of Collection
ch: 集合类型记录

# sys_collection.title
source: Collection-Name
ch: 集合-名称

# sys_collection.type
source: Type of collection
ch: 集合类型

# sys_collection.type.static
source: static record composition
ch: 静态记录组合

# sys_file
source: File
ch: 文件

# sys_file.alternative
source: Alternative Text
ch: 可替代文本

# sys_file.description
source: Description
ch: 描述

# sys_file.identifier
source: Identifier
ch: 标识符

# sys_file.metadata
source: Metadata records
ch: 元数据记录

# sys_file.missing
source: Marked as missing
ch: 标记为丢失

# sys_file.name
source: Filename
ch: 文件名

# sys_file.size
source: Size
ch: 大小

# sys_file.storage
source: Storage
ch: 存储

# sys_file.title
source: Title
ch: 标题

# sys_file.type
source: File Type
ch: 文件类型

# sys_file.type.audio
source: Audio
ch: 音频

# sys_file.type.image
source: Image
ch: 图片

# sys_file.type.software
source: Software
ch: 软件

# sys_file.type.text
source: Text
ch: 文本

# sys_file.type.unknown
source: Unknown
ch: 未知

# sys_file.type.video
source: Video
ch: 视频

# sys_file.usage_count
source: Usage Count
ch: 使用计数

# sys_file_collection
source: File collection
ch: 文件集合

# sys_file_collection.category
source: Category
ch: 分类

# sys_file_collection.files
source: Files
ch: 文件

# sys_file_collection.folder
source: Folder
ch: 文件夹

# sys_file_collection.storage
source: File Storage
ch: 文件存储

# sys_file_collection.title
source: Title
ch: 标题

# sys_file_collection.type
source: Type
ch: 类型

# sys_file_collection.type.1
source: Folder from Storage
ch: 存储的文件夹

# sys_file_collection.type.2
source: Select by category
ch: 按分类选择

# sys_file_metadata
source: File Metadata
ch: 文件元数据

# sys_file_reference
source: File Reference
ch: 文件引用

# sys_file_reference.alternative
source: Alternative Text
ch: 可替代文本

# sys_file_reference.basicoverlayPalette
source: File Metadata
ch: 文件元数据

# sys_file_reference.crop
source: Image manipulation
ch: 图片处理

# sys_file_reference.description
source: Description (Caption)
ch: 描述（标题）

# sys_file_reference.downloadname
source: Download Name
ch: 下载名称

# sys_file_reference.fieldname
source: Foreign Field
ch: 外部字段

# sys_file_reference.imageoverlayPalette
source: Image Metadata
ch: 图片元数据

# sys_file_reference.link
source: Link
ch: 链接

# sys_file_reference.sorting_foreign
source: Sorting foreign
ch: 排序外部

# sys_file_reference.tablenames
source: Table name
ch: 表名称

# sys_file_reference.title
source: Title
ch: 标题

# sys_file_reference.uid_foreign
source: Used by content elements
ch: 由内容元素使用

# sys_file_reference.uid_local
source: File
ch: 文件

# sys_file_storage
source: File Storage
ch: 文件存储

# sys_file_storage.capabilities
source: Capabilities
ch: 能力

# sys_file_storage.configuration
source: Driver Configuration
ch: 驱动配置

# sys_file_storage.description
source: Description
ch: 描述

# sys_file_storage.driver
source: Driver
ch: 驱动

# sys_file_storage.driver.local
source: Local Filesystem
ch: 本地文件系统

# sys_file_storage.hidden
source: Hide from listings
ch: 从列表隐藏

# sys_file_storage.is_browsable
source: Is browsable?
ch: 可浏览？

# sys_file_storage.is_default
source: Is default storage?
ch: 是默认的存储？

# sys_file_storage.is_online
source: Is online?
ch: 在线?

# sys_file_storage.is_public
source: Is publicly available?
ch: 可公开？

# sys_file_storage.is_writable
source: Is writable?
ch: 可写？

# sys_file_storage.name
source: Name
ch: 名字

# sys_file_storage.processingfolder
source: Folder for manipulated and temporary images etc.
ch: 操作和临时文件使用的的文件夹

# sys_file_storage.type
source: Entry point
ch: 记录点

# sys_filemounts
source: Filemount
ch: 文件挂接点

# sys_filemounts.base
source: Base:
ch: 基准：

# sys_filemounts.base_absolute
source: absolute (root) /
ch: 绝对(root) /

# sys_filemounts.base_relative
source: relative ../fileadmin/
ch: 相对../fileadmin/

# sys_filemounts.path
source: Path:
ch: 路径：

# sys_filemounts.read_only
source: Read-only:
ch: 只读：

# sys_filemounts.tabs.mountpoints
source: Mountpoints
ch: 加载点

# sys_filemounts.tabs.other
source: Other
ch: 其它

# sys_filemounts.tabs.publishing
source: Publishing
ch: 发布

# sys_filemounts.tabs.users
source: Users
ch: 用户

# sys_filemounts.title
source: Label:
ch: 标签：

# sys_language
source: Website Language
ch: 网站语言

# sys_language.flag
source: Select flag icon:
ch: 选择旗标

# sys_language.isocode
source: Select Official Language (ISO code):
ch: 选择官方语言(ISO码)

# sys_language.language_isocode
source: Select language:
ch: 选择语言：

# sys_log
source: System Log
ch: 系统日志

# sys_news
source: System News
ch: 系统消息

# sys_news.tabs.access
source: Access
ch: 访问

# sys_workspace
source: Workspace
ch: 工作区

# sys_workspace.adminusers
source: Owners:
ch: 所有者：

# sys_workspace.disable_autocreate
source: Disable auto-versioning when editing
ch: 编辑时禁止自动版本管理

# sys_workspace.freeze
source: Freeze Editing
ch: 冻结编辑：

# sys_workspace.live_edit
source: Allow "live" editing of records from tables without versioning
ch: 允许实时编辑表记录且没有版本管理

# sys_workspace.members
source: Members:
ch: 成员：

# sys_workspace.publish_access
source: Publish access:
ch: 发布访问：

# sys_workspace.publish_time
source: Publish:
ch: 发布：

# sys_workspace.review_stage_edit
source: Allow members to edit records in "Review" stage
ch: 允许成员编辑审核层记录

# sys_workspace.reviewers
source: Reviewers:
ch: 审核者：

# sys_workspace.stagechg_notification
source: Stage change notification by email:
ch: 工作台改变邮件提醒：

# sys_workspace.swap_modes
source: Swap modes
ch: 交换模式

# sys_workspace.unpublish_time
source: Un-Publish:
ch: 未发布：

# sys_workspace.vtypes
source: Disable Versioning Types for members and reviewers:
ch: 禁止成员和审核者的版本类型

# title
source: Pagetitle:
ch: 页面标题

# userMods
source: Modules:
ch: 模块：

# workspace_perms
source: Workspace permissions:
ch: 工作空间权限：

# workspace_perms_custom
source: Create new workspace projects
ch: 创建新的工作空间项目

# workspace_perms_draft
source: Edit Draft (Offline)
ch: 编辑草稿（离线）

# workspace_perms_live
source: Edit Live (Online)
ch: 编辑实时（在线）
