<?php
/*
+--------------------------------------------------------------------------
|   thinkask [#开源系统#]
|   ========================================
|   http://www.thinkask.cn
|   ========================================
|   如果有兴趣可以加群{开发交流群} 485114585
|   ========================================
|   更改插件记得先备份，先备份，先备份，先备份
|   ========================================
+---------------------------------------------------------------------------
 */

namespace app\index\model;
use think\Model;
use think\Db;
class Index extends Model
{
    // protected $pk = 'uid';
    // protected $table = 'think_user';
    static public function test(){
    	echo "string";
    }
   
}