<?php
// Text
$_['text_title']						= 'باي بال اكسبرس - بطاقة ائتمانية';
$_['text_paypal_express']				= 'باي بال اكسبرس';
$_['text_paypal_card']					= 'بطاقة ائتمانية - بواسطة باي بال';
$_['text_wait']							= 'الرجاء الانتظار !';
$_['text_order_message']				= 'حماية البائع لدى باي بال - %s';

// Entry
$_['entry_card_number']					= 'رقم البطاقة الائتمانية';
$_['entry_expiration_date']				= 'تاريخ انتهاء البطاقة';
$_['entry_cvv']							= 'رمز - CVV';

// Button
$_['button_pay']						= 'الدفع بواسطة البطاقة الائتمانية';

// Error
$_['error_warning']						= 'الرجاء مراجعة الخانات الخاطئة بعناية.';
$_['error_3ds_error']					= 'حدث خطأ في نظام المصادقة ثلاثية الابعاد.';
$_['error_3ds_skipped_by_buyer']		= 'لقد قمت بتخطي الحماية الثلاثية الابعاد.';
$_['error_3ds_failure']					= 'ربما لم يتم التحقق من الجهاز.';
$_['error_3ds_undefined']				= 'شبكة البطاقة لا تتطلب حماية ثلاثية الابعاد.';
$_['error_3ds_bypassed']				= 'تم تخطي الحماية الثلاثية الابعاد لأنها غير مطلوبة في هذا التوثيق.';
$_['error_3ds_unavailable']				= 'البنك المصدر للبطاقة غير قادر على إكمال المصادقة.';
$_['error_3ds_attempted']				= 'البطاقة غير مسجلة في برنامج الحماية الثلاثية الابعاد لأن المصرف الذي أصدر البطاقة غير مشترك في الحماية الثلاثية الابعاد.';
$_['error_3ds_card_ineligible']			= 'البطاقة غير مؤهلة للمصادقة الثلاثية الابعاد.';
$_['error_payment']						= 'الرحاء اختيار طريقة دفع أخرى أو  <a href="%s" target="_blank">تواصل معنا</a>.';
$_['error_timeout'] 	  				= 'نأسف، موقع باي بال مشغول حالياً. الرجاء المحاولة مرة أخرى لاحقاً !';
