<?php
$lang = array(
	'e_0000' => '操作成功',
	'e_0001' => '操作失败',
	//DEBUG 用户模块
	'e_1000' => '登录成功',
	'e_1001' => '用户名或密码错误',
	//文件上传
	'e_2000' => '上传成功',
	'e_2001' => '文件域的名称错误',
	'e_2002' => '文件大小超过了php.ini定义的upload_max_filesize值',
	'e_2003' => '文件大小超过了HTML定义的MAX_FILE_SIZE值',
	'e_2004' => '文件上传不完全',
	'e_2005' => '无文件上传',
	'e_2006' => '缺少临时文件夹',
	'e_2007' => '写文件失败',
	'e_2008' => '上传被其它扩展中断',
	'e_2009' => '无有效错误代码',
	'e_2010' => '文件上传失败,请重新上传(001)',
	'e_2011' => '请不要上传大小超过###XXX###的文件',
	'e_2012' => '',
	'e_2013' => '文件缩略图生成失败,请重新上传',
	'e_2014' => '上传文件扩展名必需为:',
	'e_2015' => '文件上传失败,请重新上传(002)',
	'e_2016' => '您无权限上传',
	//错误帮助
    'error_end_message'=>'QQ:28315279 E-mail:info@512cs.com',
);
?>