<?php

$anti_word = '/
江泽民
|胡锦涛
|共产党
|毛主席
|中共
|中国共产党
|弹药
|枪支
|氣槍
|猎槍
|来福
|雷鸣登
|招聘兼职
|直流电阻测试仪
|继电保护测试仪
|串联谐振
|分压器
|武汉网站优化
|武汉网络推广
|武汉网络营销
|武汉SEO
|大脚骨矫正器
|拇外翻
|薄熙来
|谷开来
|唱红打黑
|听党指挥
|薄一波
|李长春
|周永康
|zhenfu
|傻逼
|谋杀
|就义
|法轮功
|邪教
|薄熙莱
|小姐上门
|一夜情
|性息
|按摩服务
|包夜
|微笑网络
|刷信誉
|小 妹
|小 妹 上 门
|王哥
|花姐
|学妹
|姓ˊ感ˊ少ˊ妇
|丰ˊ韵ˊ熟ˊ妇
|丽人岛休闲会所
|越ˊ南ˊ妹
|77057
|饥ˊ渴ˊ熟ˊ女
|饥渴熟女
|性感人妻
|姓感少妇
|51够酷
|tdjyedu
|身份證买卖
|身份证买卖
|895316992
|爱游中国
|上門服务
|小妹服务
|sm女王
|包吹
|福彩3d
|丰韵熟妇
|發票
|亚布力
|新皇宝
|校花聊天室
|消费投资合法
|西安卖肾
|丝袜交友
|草榴社区
|代開
|代开
|醱票
|開瞟
|瞟据
|瞟务
|费發
|糖尿病治疗仪
|糖尿病
|便秘
|肝硬化
|鸡巴
|芬恩
|宏天景秀
|穫獎查詢
|中獎
|熱線
|嘿咻
|湿疹
|花月婷
|新葡京娱乐城
|TT娱乐城
|娱乐城
|草榴
|caoliu
|cao
|公關
|丝足
|女王
|调教
|你妈
|反腐
|妈的
/i';
$anti_word = preg_replace('/\s/', '', $anti_word);

foreach ($_POST as $k => $_P) {
	if (in_array($k, array('c', 'a'))) continue;
	if (preg_match($anti_word, $_P, $m)){
		if (in_array($_GET['c'], array('user', 'finance'))) {
			die('内容中存在被禁止使用的词汇：'.$m[0]);
		} else {
			die(json_encode(array('msg' => '内容中存在被禁止使用的词汇：'.$m[0], 'token' => get_token())));
		}
	}
}
