<?php
return array(
    /********************************基本参数********************************/
    'LOAD_EXT_CONFIG'               => '',          //拓展配置
    'LOAD_EXT_FILE'                 => '',          //加载扩展文件
    'APP_AUTOLOAD_PATH'             => '',          //自动加载路径
    'APP_AUTOLOAD_NAMESPACE'        => array(),     //自动加载命名空间
    /********************************数据库********************************/
    'DB_DRIVER'                     => 'mysqli',    //驱动
    'DB_CHARSET'                    => 'utf8',      //字符集
    'DB_HOST'                       => '127.0.0.1', //主机
    'DB_PORT'                       => 3306,        //端口
    'DB_USER'                       => 'root',      //帐号
    'DB_PASSWORD'                   => '',          //密码
    'DB_DATABASE'                   => '',          //数据库
    'DB_PREFIX'                     => '',          //表前缀
    /********************************模板参数********************************/
    'TPL_PATH'                      => 'View',      //目录
    'TPL_EXT'                       => '.html',     //文件扩展名
    'TPL_TAGS'                      => array(),     //标签类
    /********************************URL路由********************************/
    'ROUTE'                         => array(),     //路由配置
);
?>