<?php
/**
 * 帐号权限配置
 * 本配置仅针对集成common/controller/Manage.php有效
 * 'auth' => 1, //权限值(多个数组必须唯一)
 * 'name' => '权限名称一', //权限名称
 * 'group' => ['控制器名称' => ['name' => '权限名称|可不设置','action' => ['方法','方法']]]   //如果控制器中 action 值为空,那控制器中所有方法都有权限
 * 
return [
    [
        'auth' => 1,
        'name' => '权限组名称1',
        'group' => [
            '控制器1' => ['name' => '权限名称1','action' => ['方法','方法','方法']],
            '控制器2' => ['name' => '权限名称2','action' => ['方法','方法','方法']],
        ]
    ], 
    [
        'auth' => 2,
        'name' => '权限组名称2',
        'group' => [
            '控制器1' => ['name' => '权限名称1','action' => ['方法','方法','方法']],
            '控制器2' => ['name' => '权限名称2','action' => ['方法','方法','方法']],
        ]
    ], 
];
 */
return [
    [
        'auth' => 1,
        'name' => '权限组名称1',
        'group' => [
            '控制器1' => ['name' => '权限名称1','action' => ['方法','方法','方法']],
            '控制器2' => ['name' => '权限名称2','action' => ['方法','方法','方法']],
        ]
    ], 
    [
        'auth' => 2,
        'name' => '权限组名称2',
        'group' => [
            '控制器1' => ['name' => '权限名称1','action' => ['方法','方法','方法']],
            '控制器2' => ['name' => '权限名称2','action' => ['方法','方法','方法']],
        ]
    ], 
];