<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
	'CONFIG_GROUP_LIST' => [
		0 => ['id'=>1, 'name'=>'基本'],
		1 => ['id'=>2, 'name'=>'系统'],
		2 => ['id'=>3, 'name'=>'用户'],
	],

	'CONFIG_GROUP_TYPE' => [
		0 => ['id'=>0, 'type'=>'数字'],
		1 => ['id'=>1, 'type'=>'字符'],
		2 => ['id'=>2, 'type'=>'文本'],
		3 => ['id'=>3, 'type'=>'数组'],
		4 => ['id'=>4, 'type'=>'枚举'],
	],

	// 'extra_file_list' => [
	// 	'functions',
	// ],

	'menu_module' => [
		0 => ['module'=>'admin', 'name'=>'管理后台'],
		1 => ['module'=>'shop', 'name'=>'商家后台'],
	]

];
