<?php
// +----------------------------------------------------------------------
// | RXThink框架 [ RXThink ]
// +----------------------------------------------------------------------
// | 版权所有 2017~2019 南京RXThink工作室
// +----------------------------------------------------------------------
// | 官方网站: http://www.rxthink.cn
// +----------------------------------------------------------------------
// | Author: 牧羊人 <rxthink@gmail.com>
// +----------------------------------------------------------------------

/**
 * 后台公共配置文件
 * 
 * @author 牧羊人
 * @date 2019-01-12
 */
return [
    // 模板参数替换
    'view_replace_str' => [
        '__ADMIN__'     => '/static/admin',
        '__CSS__'       => '/static/admin/css',
        '__JS__'        => '/static/admin/js',
        '__IMAGES__'    => '/static/admin/images',
        '__LIB__'       => '/static/admin/lib',
        '__PLUGINS__'   => '/static/admin/plugins',
        '__UPLOAD__'    => '/uploads/admin/',
    ],
];