<?php
/*
*	Package:		PHPCrazy
*	Link:			http://zhangyun.org/
*	Author: 		Crazy <mailzhangyun@qq.com>
*	Copyright:		2014-2015 Crazy
*	License:		Please read the LICENSE file.
*/

if (!isset($lang) || empty($lang) || !is_array($lang)) {
	$lang = array();
}

$lang = array_merge($lang, 

	array(
		'论坛'	=> '論壇',
		'下载'	=> '下載',
		'社区'	=> '社區',
		'博客'	=> '博客',
		'导航'	=> '導航',
		'文章'	=> '文章',
		'小说'	=> '小說',
		'图片'	=> '圖片',
		'更多'	=> '更多..',
		'分享'	=> '分享',
		'二维码'	=> '二維碼',
		'GitHub'	=> 'GitHub',
		'下载使用'	=> '下載使用',
		'Bug 反馈'	=> 'Bug 反饋',
		'您好，站长！'	=> '您好，站長！',
		'首页安装完成说明' => '當您看到此頁面的時候，程序已經安裝完成，請及時刪除 %s 文件夾！',
		'首页模版位置说明' => '此頁面的內容在 %s !',
		'首页后台入口说明' => '要進入後臺請訪問 %s',

		'最新文章' => '最新文章',

		'首页测试文章 数组' => array(
			'物質雖貧乏，心裏不潦倒',
			'科學就是追求簡單',
			'這是通往成功的道路，不過在施工，記得帶好安全帽',
			'公交稱都做不起還冒充黑客帝國',
			'有目標的認錯才有防線有規劃的人生更精彩',
			'真愛一生一世，需要堅持再堅持',
			'淡，是生命的底色'
		)
	)
);