<?php
/*
*	
*	Package:		PHPCrazy
*	Link:			http://zhangyun.org/
*	Author: 		Crazy <mailzhangyun@qq.com>
*	Copyright:		2014-2015 Crazy
*	License:		Please read the LICENSE file.
*/

if (!isset($lang) || empty($lang) || !is_array($lang)) {
	$lang = array();
}



$lang = array_merge($lang, 

	array(
		'网站后台管理' 				=> '網站後臺管理',
		'模块名 后台'				=> '%s - 網站後臺管理',
		'标题 模块名 后台'			=> '%s - %s - 網站後臺管理',

		'常规设置'					=> '常規設置',
		'邮件设置'					=> '郵件設置',
		'邮件发送'					=> '郵件發送',
		'邮件发送 说明'				=> '開啟它您可以在綫發送電子郵件',
		'使用SMTP发送邮件'			=> 'SMTP郵件',
		'使用SMTP发送邮件 说明'		=> '本功能可以替代系統的mail()函式發送郵件',
		'使用SSL发送邮件'			=> '使用SSL發送郵件',
		'SMTP信息'					=> 'SMTP信息',
		'SMTP服务器'				=> '服務器',
		'SMTP服务器 说明'			=> '用來發送郵件的服務器',
		'SMTP端口'					=> '端口',
		'SMTP端口 说明'				=> '郵件服務器的端口',		
		'SMTP用户'					=> '用戶名',
		'SMTP用户 说明'				=> 'SMTP用戶名',
		'SMTP密码'					=> '密碼',
		'SMTP密码 说明'				=> 'SMTP密碼',

		'系统邮件地址'				=> '系統郵件地址',

		'基本设置'					=> '基本設置',

		'网站标题'					=> '網站標題',
		'网站标题 说明'				=> '顯示在瀏覽器頂部欄的標題',

		'时区设置'					=> '時區',
		'时区设置 说明'				=> '請選擇與您設備時間相同的時區，您當前的時區(%s:%s)',
		'时间格式'					=> '時間格式',
		'时间格式 说明'				=> '時間的格式遵循php的时间格式遵循php的 <a href="http://php.net/manual/zh/function.date.php">format</a> 標準',
		'语言'						=> '語言',
		'HTTPS'						=> 'HTTPS',
		'HTTPS 说明'				=> '如果您的服務器不支持 https 訪問請不要開啟',

		'SEO优化'					=> 'SEO優化',

		'网站作者'					=> '作者',
		'网站作者 说明'				=> '填寫您的名字',
		'网站关键词'				=> '關鍵詞',
		'网站关键词 说明'			=> '輸入您網站的關鍵詞',
		'网站描述'					=> '描述',
		'网站描述 说明'				=> '描述您網站的一段文字',

		'网站设置保存成功'			=> '網站設置保存成功',
		'邮件设置保存成功'			=> '郵件設置保存成功',

		'用户管理'					=> '用戶',

		'管理指定用户 说明'			=> '小提示：點擊用戶名可以管理該用戶',

		'请指定用户'				=> '請指定用戶',
		'管理更改密码 说明'			=> '如果您不希望更改此用戶的密碼請留空',
		'修改权限 说明'				=> '權限層次（從高到低）：主人->管理員->會員->遊客',

		'主题设置'					=> '主題',
		'默认主题'					=> '默認主題',
		'主题设置 说明'				=> '您需要先把主題上傳到 themes 文件夾中，主題才會出現在這裡。',

	)
);