<?php
/*
*	Package:		PHPCrazy
*	Link:			http://zhangyun.org/
*	Author: 		Crazy <mailzhangyun@qq.com>
*	Copyright:		2014-2015 Crazy
*	License:		Please read the LICENSE file.
*/

// 本翻譯並非來自專業的翻譯人員
// 如果翻譯錯誤或不恰當的地方請指出
// 來自：Crazy

if (!isset($lang) || empty($lang) || !is_array($lang)) {
	$lang = array();
}

$lang = array_merge($lang, 

	array(

		'问候 用户名'		=> '您好, %s ！',
		'游客 随机数'		=> '遊客%d',
		'用户名 用户中心'	=> '%s - 用戶中心',

		'首页'				=> '首頁',
		'后台'				=> '管理',
		'登录'				=> '登錄',
		'注册'				=> '註冊',
		'注销'				=> '註銷',
		'选择'				=> '選擇',
		'提交'				=> '提交',

		'注册成功'			=> '註冊成功',

		'ID'				=> 'ID',
		'注册时间'			=> '註冊時間',
		'帐号'				=> '帐号',
		'邮箱 ID 用户名'	=> 'Email / ID / 用戶名',
		'密码'				=> '密碼',
		'输入密码'			=> '請輸入密碼',
		'用户名'			=> '用戶名',
		'输入用户名'		=> '請輸入用戶名',
		'输入用户名说明'	=> '1至12字符,不能為全數字',
		'输入邮箱说明'		=> '當忘記密碼時您可以通過電子郵件找回密碼',
		'输入密码说明'		=> '建議不要把密碼設置過於簡單',
		'确认密码'			=> '確認密碼',
		'输入确认密码说明'	=> '請再次輸入密碼',
		'验证码'			=> '驗證碼',
		'输入验证码 说明'	=> '點擊圖片可以刷新驗證碼，請計算出上圖的結果，如果結果為負數用 - 『負號』來表示，例如：-1',
		'验证码不正确'		=> '驗證碼不正確',
		'完成注册'			=> '完成註冊',
		'新密码'			=> '新密碼',
		'确认新密码'		=> '確認新密碼',

		'搜索用户'			=> '尋找用戶',
		'搜索结果'			=> '尋找結果',

		'确认'				=> '確認',
		'保存'				=> '保存',
		'返回上级'			=> '返回上级',

		'SQL'				=> 'SQL',
		'行'				=> '行',
		'文件'				=> '文件',

		'修改账号信息'				=> '修改帳號信息',
		'邮箱'						=> 'Email',
		'找回密码'					=> '找回密碼',
		'发送邮件'					=> '發送郵件',

		'输入邮箱地址'				=> '請輸入Email地址',

		'激活邮件发送 邮箱 说明' 	=> '系統已將激活鏈接發送到您的郵箱，請注意查收！',

		'SQL错误' 			=> 'SQL錯誤',
		'SQL执行出错'		=> 'SQL執行出錯',
		'错误'				=> '錯誤',
		'提示'				=> '提示',
		'模版 文件 不存在' 	=> '模版 %s 不存在',
		'模版 文件 无法打开'=> '模版 %s 無法打開',
		'用户中心' 			=> '用戶中心',
		'密码不能为空'		=> '密碼不能為空',
		'账号不能为空'		=> '帳號不能為空',
		'密码错误'			=> '密碼錯誤',
		'帐号不存在'		=> '帳號不存在',
		'用户不存在'		=> '沒有此用戶',
		'重置密码'			=> '重置密碼',
		'您的新密码'		=> '您的新密碼',
		'密码重置成功'		=> '密碼重置成功',
		'输入密码不一样'	=> '兩次輸入的密碼不一樣',
		'激活链接无效'		=> '激活鏈接無效',
		'非法操作'			=> '非法操作',
		'忘记密码'			=> '忘記密碼',

		'！用户名不能为空'		=> '對不起，用戶名不能為空',
		'！用户名不能为全数字'	=> '對不起，用戶名不能為全數字',
		'！用户名带有非法字符'	=> '對不起，用戶名含有非法字符',
		'！用户名太长'			=> '對不起，用戶名不能超過12個字符',
		'！用户名已存在'		=> '對不起，該用戶已存在',


		'邮箱未注册'		=> '該Email還沒註冊',
		'邮箱已注册'		=> '該 Email 已存在',
		'邮箱无效'			=> '無效的 Email',

		'注册'				=> '註冊',

		'开启Email发送'		=> '請開啟Email發送功能',

		'是'				=> '是',
		'否'				=> '否',

		'开启'				=> '開啟',
		'关闭'				=> '關閉',

		'开'				=> '開',
		'关'				=> '關',

		'刷新'				=> '刷新',

		'用户列表'			=> '用戶列表',
		'权限'				=> '權限',
		'权限不足'			=> '權限不足',
		'用户资料已保存'	=> '用戶資料已保存',
		'关键词为空'		=> '關鍵詞為空',

		'版权所有 年 作者'	=> 'CopyRight©%s %s.',

		'Auth'			=> 
			array(
				ANONYMOU 		=> '遊客',
				USER 			=> '會員',
				ADMIN 			=> '管理員',
				MASTER   		=> '主人'
			),

		// 时区
		// 详情请参考 http://php.net/manual/zh/timezones.others.php
		'timezone' 			=>
			array(
				'PRC' 				=> '中華人民共和國',
				'America/New_York' 	=> '紐約時間',
			)
	)
);