<?php
// Text
$_['text_success']     = '成功：拡張を変更しました！';
$_['text_unzip']       = 'ファイルの抽出！';
$_['text_move']        = 'ファイルのコピー！';
$_['text_xml']         = '変更を適用する！';
$_['text_remove']      = '臨時ファイルを削除！';

// Error
$_['error_permission'] = '警告：拡張機能を変更する権限がありません！';
$_['error_install']    = '拡張インストールが実行されるまで数秒待ってからインストールしてください！';
$_['error_unzip']      = 'Zipファイルを開くことができませんでした。';
$_['error_file']       = 'インストールファイルが見つかりませんでした！';
$_['error_directory']  = 'インストールディレクトリが見つかりませんでした！';
$_['error_code']       = '変更XMLにはユニークのコードが必要です！';
$_['error_xml']        = '変更%sはすでに使用されています！ ';
$_['error_exists']     = 'ファイル%sは既に存在します！';
$_['error_allowed']    = 'ディレクトリ%sは書き込めません！';