<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 上传附件基础控制（无需修改）,在[管理后台->系统设置->远程附件]中修改。
// +----------------------------------------------------------------------

use think\facade\Request;
return [
    'upload_path'          => date('Ymd').'/',   //文件基于根目录的目录规则
    'upload_driver'        => 'local',    //使用的上传驱动
    'upload_size'          => '10', //MB
    'upload_exts'          => 'jpeg,jpg,gif,bmp,png,doc,xls,mp4,m4a,mp3,aac',
    'upload_relative'      => Request::root(true).'/', //访问域名
    'upload_driver_config' => [
        'local' => [
            'driver' => 'local'
        ],
        /* 城市名称：
        *  经典网络下可选：杭州、上海、青岛、北京、张家口、深圳、香港、硅谷、弗吉尼亚、新加坡、悉尼、日本、法兰克福、迪拜
        *  VPC 网络下可选：杭州、上海、青岛、北京、张家口、深圳、硅谷、弗吉尼亚、新加坡、悉尼、日本、法兰克福、迪拜
        */
        'oss' => [
            'driver'      => 'oss',
            'city'        => '',
            'access_id'   => '',
            'secret_key'  => '',
            'bucket'      => '',
            'domain'      => '', //必须 / 结尾
            'isInternal'  => false,
        ]
    ],
];