<?php 
// Textmade by bestshop24h.com
$_['text_subject']        = '%s - ご登録ありがとうございます';
$_['text_welcome']        = 'ようこそ、登録していただきありがとうございます %s!';
$_['text_login']          = 'あなたのアカウントが作成されました。あなたのメールアドレスとパスワードを使用して、当社のウェブサイトまたは次のURLにアクセスしてログインすることができます:';
$_['text_approval']       = 'あなたのアカウントは、ログインする前に承認されている必要があります。 承認されたら、当社のウェブサイトまたは次のURLにアクセスして、メールアドレスとパスワードを使用してログインすることができます:';
$_['text_service']        = 'ログインすると、過去の注文の確認、請求書の印刷、アカウント情報の編集などの他のサービスにアクセスすることができます。';
$_['text_thanks']         = 'ありがとう,';
$_['text_new_customer']   = '新顧客';
$_['text_signup']         = '新しい顧客がサインアップしました:';
$_['text_customer_group'] = '顧客グループ:';
$_['text_firstname']      = '氏名(姓):';
$_['text_lastname']       = '氏名(名):';
$_['text_email']          = 'メールアドレス:';
$_['text_telephone']      = '電話番号:';