<script>
    export default {
    };
</script>
<template>
    <div class="tab-item" id="shop-process">
        <div class="item-title"><span>购物流程</span></div>
        <div class="item-title-content">
            <div class="content-model">
                <p>一、什么是次日达？</p>
                <p>次日达是新推出的一项配送服务，旨在优化商品配送时效，提升客户体验，将全球好货尽快送达用户手中</p>
                <p>指定商品、指定收货地址的现货订单，当日14:00前下单并支付完成，商品将最快于次日送达</p>
            </div>
            <div class="content-model">
                <p>二、支持次日达服务的商品</p>
                <p>以下仓库商品支持次日达：</p>
                <p>杭州保税1号仓、杭州保税3号仓、杭州保税5号仓、宁波保税1号仓、宁波保税2号仓</p>
                <p>其他仓库商品暂不支持，具体请以商品详情页说明为准</p>
            </div>
            <div class="content-model">
                <p>三、次日达服务覆盖区域</p>
                <p>目前次日达配送服务已覆盖的城市/区域如下</p>
                <p>上海市</p>
                <p>宝山区、奉贤区、虹口区、黄浦区、嘉定区、金山区、静安区、闵行区、浦东新区、普陀区、青浦区、松江区、徐汇区、杨浦区、闸北区、长宁区</p>
                <p>浙江省</p>
                <p>杭州市（滨江区、拱墅区、江干区、上城区、西湖区、下城区、萧山区、余杭区）</p>
                <p>宁波市（北仑区、慈溪市、海曙区、江北区、江东区、余姚市、镇海区、鄞州区、高新科技开发区、宁波保税区）</p>
                <p>温州市（龙湾区、鹿城区、瓯海区）</p>
                <p>嘉兴市（海宁市、嘉善县、南湖区、桐乡市、秀洲区）</p>
                <p>湖州市（南浔区、吴兴区）</p>
                <p>绍兴市（柯桥区、越城区、绍兴市区）</p>
                <p>金华市（金东区、婺城区）</p>
                <p>台州市（黄岩区、椒江区、路桥区）</p>
            </div>
            <div class="content-model">
                <p>四、其他说明</p>
                <p>支持次日达物流配送的具体订单，可能会因法定节假日、中大促销活动（如双十一、双十二等）、交通管制、自然灾害或其他不可抗拒因素等原因，
                    导致实际到货时间有所延迟。将依据消费者诉求与相关规则进行相应处理</p>
            </div>
        </div>
    </div>
</template>