<?php
// +----------------------------------------------------------------------
// | Copyright (c) 2017 http://www.sycit.cn
// +----------------------------------------------------------------------
// | Author: Peter.Zhang  <hyzwd@outlook.com>
// +----------------------------------------------------------------------
// | Date:   2017/12/6
// +----------------------------------------------------------------------
// | Title:  FinanceSchedule.php
// +----------------------------------------------------------------------
namespace app\index\model;

use think\Model;

class FinanceSchedule extends Model
{
    protected $autoWriteTimestamp = true; // 自动写入时间戳
}