<?php

// +----------------------------------------------------------------------
// | LvyeCMS 内容模块配置
// +----------------------------------------------------------------------
// | Copyright (c) 2012-2014 http://www.lvyecms.com, All rights reserved.
// +----------------------------------------------------------------------
// | Author: 旅烨集团 <web@alvye.cn>
// +----------------------------------------------------------------------
return array(
    //模块名称
    'modulename' => '内容模块',
    //模块简介
    'introduce' => '这是一个功能强大的内容管理模块。',
    //模块介绍地址
    'address' => 'http://www.lvyecms.com',
    //模块作者
    'author' => '水平凡',
    //作者地址
    'authorsite' => 'http://www.lvyecms.com',
    //作者邮箱
    'authoremail' => 'admin@abc3210.com',
    //版本号，请不要带除数字外的其他字符
    'version' => '1.0.0',
    //适配最低LvyeCMS版本，
    'adaptation' => '2.0.0',
    //签名
    'sign' => '53aca6c9973b327a6b6de720b45940f4',
    //依赖模块
    'depend' => array(),
);
