<?php
/*
*	Package:		PHPCrazy
*	Link:			http://zhangyun.org/
*	Author: 		Crazy <mailzhangyun@qq.com>
*	Copyright:		2014-2015 Crazy
*	License:		Please read the LICENSE file.
*/

if (!isset($lang) || empty($lang) || !is_array($lang)) {
	$lang = array();
}

$lang = array_merge($lang, 

	array(
		'论坛'	=> '论坛',
		'下载'	=> '下载',
		'社区'	=> '社区',
		'博客'	=> '博客',
		'导航'	=> '导航',
		'文章'	=> '文章',
		'小说'	=> '小说',
		'图片'	=> '图片',
		'更多'	=> '更多..',
		'分享'	=> '分享',
		'二维码'	=> '二维码',
		'GitHub'	=> 'GitHub',
		'下载使用'	=> '下载使用',
		'Bug 反馈'	=> 'Bug 反馈',
		'您好，站长！'	=> '您好，站长！',
		'首页安装完成说明' => '当你看到此页面的时候，程序已经安装完成，请及时删除 %s 文件夹！',
		'首页模版位置说明' => '此页面的内容在 %s !',
		'首页后台入口说明' => '要进入后台请访问 %s',

		'最新文章' => '最新文章',

		'首页测试文章 数组' => array(
			'物质虽贫乏，心理不潦倒',
			'科学就是追求简单',
			'这是通往成功的道路，不过还在施工，记得戴好安全帽',
			'公交车都坐不起还冒充黑客帝国',
			'有目标的人生才有方向有规划的人生才更精彩',
			'真爱一生一世，需要坚持再坚持',
			'淡，是生命的底色'
		)
	)
);