<?php
/*
*	
*	Package:		PHPCrazy
*	Link:			http://zhangyun.org/
*	Author: 		Crazy <mailzhangyun@qq.com>
*	Copyright:		2014-2015 Crazy
*	License:		Please read the LICENSE file.
*/

if (!isset($lang) || empty($lang) || !is_array($lang)) {
	$lang = array();
}



$lang = array_merge($lang, 

	array(
		'管理'	 					=> '管理',
		'模块名 管理'				=> '%s - 管理',
		'标题 模块名 管理'			=> '%s - %s - 管理',

		'设置'						=> '设置',
		'后台面板 欢迎'				=> '欢迎来到PHPCrazy管理页面！',

		'常规设置'					=> '常规设置',
		'邮件设置'					=> '邮件设置',
		'邮件发送'					=> '邮件发送',
		'邮件发送 说明'				=> '开启它后您可以在线发送电子邮件',
		'使用SMTP发送邮件'			=> 'SMTP邮件',
		'使用SMTP发送邮件 说明'		=> '本功能可以替代系统 mail() 发送邮件',
		'使用SSL发送邮件'			=> '使用SSL发送邮件',
		'SMTP信息'					=> 'SMTP信息',
		'SMTP服务器'				=> '服务器',
		'SMTP服务器 说明'			=> '用来发送邮件的服务器',
		'SMTP端口'					=> '端口',
		'SMTP端口 说明'				=> '邮件服务器的端口',		
		'SMTP用户'					=> '用户名',
		'SMTP用户 说明'				=> 'SMTP用户名',
		'SMTP密码'					=> '密码',
		'SMTP密码 说明'				=> 'SMTP密码',

		'系统邮件地址'				=> '系统邮件地址',

		'基本设置'					=> '基本设置',

		'网站标题'					=> '网站标题',
		'网站标题 说明'				=> '显示在浏览器栏的标题',

		'时区设置'					=> '时区',
		'时区设置 说明'				=> '请选择与您设备时间相同的时区,您当前的时区(%s:%s)',
		'时间格式'					=> '时间格式',
		'时间格式 说明'				=> '时间格式遵循php的 <a href="http://php.net/manual/zh/function.date.php">format</a> 标准',
		'语言'						=> '语言',
		'HTTPS'						=> 'HTTPS',
		'HTTPS 说明'				=> '如果您的服务器不支持 https 访问请不要开启',

		'SEO优化'					=> 'SEO优化',

		'网站作者'					=> '作者',
		'网站作者 说明'				=> '填写您的名字',
		'网站关键词'				=> '关键词',
		'网站关键词 说明'			=> '输入您的网站关键词',
		'网站描述'					=> '描述',
		'网站描述 说明'				=> '描述您网站的一段文字',

		'网站设置保存成功'			=> '网站设置保存成功',
		'邮件设置保存成功'			=> '邮件设置保存成功',

		'用户管理'					=> '用户',

		'管理指定用户 说明'			=> '小提示：点击用户名可以管理该用户',

		'请指定用户'				=> '请指定用户',
		'管理更改密码 说明'			=> '如果不希望更改此用户的密码请留空',
		'修改权限 说明'				=> '权限层次(从高到低)：主人->管理员->会员->游客',

		'主题设置'					=> '主题',
		'默认主题'					=> '默认主题',
		'主题设置 说明'				=> '您需要先把主题上传到 themes 文件夹中，主题才会出现在这里。',

	)
);