<?php
/*
*	Package:		PHPCrazy
*	Link:			http://zhangyun.org/
*	Author: 		Crazy <mailzhangyun@qq.com>
*	Copyright:		2014-2015 Crazy
*	License:		Please read the LICENSE file.
*/

if (!isset($lang) || empty($lang) || !is_array($lang)) {
	$lang = array();
}

$lang = array_merge($lang, 

	array(

		'问候 用户名'		=> '您好, %s ！',
		'游客 随机数'		=> '游客%d',
		'用户名 用户中心'	=> '%s - 用户中心',

		'首页'				=> '首页',
		'后台'				=> '后台',
		'登录'				=> '登录',
		'注册'				=> '注册',
		'注销'				=> '注销',
		'选择'				=> '选择',
		'提交'				=> '提交',

		'注册成功'			=> '注册成功',

		'ID'				=> 'ID',
		'注册时间'			=> '注册时间',
		'帐号'				=> '帐号',
		'邮箱 ID 用户名'	=> 'Email / ID / 用户名',
		'密码'				=> '密码',
		'输入密码'			=> '请输入密码',
		'用户名'			=> '用户名',
		'输入用户名'		=> '请输入用户名',
		'输入用户名说明'	=> '1至12字符,不能为全数字',
		'输入邮箱说明'		=> '当忘记密码时您可以通过电子邮件找回密码',
		'输入密码说明'		=> '建议不要把密码设置过于简单',
		'确认密码'			=> '确认密码',
		'输入确认密码说明'	=> '请再次输入密码',
		'验证码'			=> '验证码',
		'输入验证码 说明'	=> '点击图片可以刷新验证码, 请计算出上图的结果, 如果结果为负数用 - （负号）来表示, 例如：-1',
		'验证码不正确'		=> '验证码不正确',
		'完成注册'			=> '完成注册',
		'新密码'			=> '新密码',
		'确认新密码'		=> '确认新密码',

		'搜索用户'			=> '查找用户',
		'搜索结果'			=> '搜索结果',

		'确认'				=> '确认',
		'保存'				=> '保存',
		'返回上级'			=> '返回上级',

		'SQL'				=> 'SQL',
		'行'				=> '行',
		'文件'				=> '文件',

		'修改账号信息'				=> '修改账号信息',
		'邮箱'						=> 'Email',
		'找回密码'					=> '找回密码',
		'发送邮件'					=> '发送邮件',

		'输入邮箱地址'				=> '请输入Email地址',

		'激活邮件发送 邮箱 说明' 	=> '系统已将激活链接发送到您的邮箱 %s,请注意查收！',

		'SQL错误' 			=> 'SQL错误',
		'SQL执行出错'		=> 'SQL执行出错',
		'错误'				=> '错误',
		'提示'				=> '提示',
		'模版 文件 不存在' 	=> '模版 %s 不存在',
		'模版 文件 无法打开'=> '模版 %s 无法打开',
		'用户中心' 			=> '用户中心',
		'密码不能为空'		=> '密码不能为空',
		'账号不能为空'		=> '账号不能为空',
		'密码错误'			=> '密码错误',
		'帐号不存在'		=> '帐号不存在',
		'用户不存在'		=> '没有此用户',
		'重置密码'			=> '重置密码',
		'您的新密码'		=> '您的新密码',
		'密码重置成功'		=> '密码重置成功',
		'输入密码不一样'	=> '两次输入的密码不一样',
		'激活链接无效'		=> '激活链接无效',
		'非法操作'			=> '非法操作',
		'忘记密码'			=> '忘记密码',

		'！用户名不能为空'		=> '对不起，用户名不能为空',
		'！用户名不能为全数字'	=> '对不起，用户名不能为全数字',
		'！用户名带有非法字符'	=> '对不起，用户名带有非法字符',
		'！用户名太长'			=> '对不起，用户名不能超过12个字符',
		'！用户名已存在'		=> '对不起，已经有该用户了',


		'邮箱未注册'		=> '该Email还没有注册',
		'邮箱已注册'		=> '该 Email 已存在',
		'邮箱无效'			=> '无效的 Email',

		'注册'				=> '注册',

		'开启Email发送'		=> '请开启Email发送功能',

		'是'				=> '是',
		'否'				=> '否',

		'开启'				=> '开启',
		'关闭'				=> '关闭',

		'开'				=> '开',
		'关'				=> '关',

		'刷新'				=> '刷新',

		'用户列表'			=> '用户列表',
		'权限'				=> '权限',
		'权限不足'			=> '权限不足',
		'用户资料已保存'	=> '用户资料已保存',
		'关键词为空'		=> '关键词为空',

		'版权所有 年 作者'	=> 'CopyRight©%s %s.',

		'Auth'			=> 
			array(
				ANONYMOU 		=> '游客',
				USER 			=> '会员',
				ADMIN 			=> '管理员',
				MASTER   		=> '主人'
			),

		// 时区
		// 详情请参考 http://php.net/manual/zh/timezones.others.php
		'timezone' 			=>
			array(
				'PRC' 				=> '中华人民共和国',
				'America/New_York' 	=> '纽约时间',
			)
	)
);