<?php
/*
*	
*	Package:		PHPCrazy
*	Link:			http://zhangyun.org/
*	Author: 		Crazy <mailzhangyun@qq.com>
*	Copyright:		2014-2015 Crazy
*	License:		Please read the LICENSE file.
*/

/*
*	本文件是安装向导的语言包
*	安装完成后您可以把这个文件删除
*/

if (!isset($lang) || empty($lang) || !is_array($lang)) {
	$lang = array();
}


$lang = array_merge($lang, 

	array(
		'安装 选择' => '选择',
		'安装向导' => '安装向导',
		'安装完成 提示' => '程序已安装, 如果您需要重新安装请先删除 #config.php 这个文件！',

		'安装 你好' => '你好',
		'安装 欢迎界面' => '安装程序已启动，接下来您只需要填写一些信息即可完成安装，如需继续请点击：',
		'安装 现在安装' => '现在安装',

		'安装 数据库信息' => '数据库',
		'安装 数据库类型' => '类型',
		'安装 数据库地址' => '地址',
		'安装 数据库名' => '名称',
		'安装 表前缀' => '表前缀',
		'安装 数据库用户' => '用户名',
		'安装 数据库密码' => '密码',
		'安装 下一步' => '下一步',

		'安装 起始ID' => '起始ID',
		'安装 用户名' => '用户名',

		'安装 网站标题' => '网站标题',
		'安装 邮箱' => '系统Email',
		'安装 密码' => '密码',
		'安装 完成安装' => '完成安装',

		'安装 安装过程出错' => '安装过程出错',
		'安装 ！请指定数据库' => '请指定数据库',
	)
);