<?php
/**
 * 123PHPSHOP
 * ============================================================================
 * 版权所有 2015 上海序程信息科技有限公司，并保留所有权利。
 * 网站地址: http://www.123PHPSHOP.com；
 * ----------------------------------------------------------------------------
 * 这是一个免费的软件。您可以在商业目的和非商业目的地前提下对程序除本声明之外的
 * 代码进行修改和使用；您可以对程序代码以任何形式任何目的的再发布，但一定请保留
 * 本声明和上海序程信息科技有限公司的联系方式！本软件中使用到的第三方代码版权属
 * 于原公司所有。上海序程信息科技有限公司拥有对本声明和123PHPSHOP软件使用的最终
 * 解释权！
 * ============================================================================
 *  作者:	123PHPSHOP团队
 *  手机:	13391334121
 *  邮箱:	service@123phpshop.com
 */
?>
<?php include_once($_SERVER['DOCUMENT_ROOT']."/Connections/localhost.php");	 ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>无标题文档</title>
<link href="../css/common_admin.css" rel="stylesheet" type="text/css" />
</head>

<body>
<form id="form1" name="form1" method="post" action="step2.php">
  <p align="center">&nbsp;</p>
  <p align="center" class="phpshop123_title"><strong>123PHPSHOP安装服务协议</strong></p>
  <p align="center">
    <label>
    <textarea name="textfield" cols="200" rows="50" height=50>©2015 上海序程信息科技有限公司。保留所有权利。
感谢您选择 123PHPSHOP商店管理系统。希望我们的努力能为您提供一个免费、开源和强大的电子商务解决方案。

上海序程信息科技有限公司为 123PHPSHOP 产品的开发商，依法独立拥有 123PHPSHOP 产品著作权
123PHPSHOP 官方网站为 http://www.123PHPSHOP.com。
123PHPSHOP 著作权已在中华人民共和国国家版权局注册，著作权受到法律和国际公约保护。使用者：无论个人或组织、盈利与否、用途如何（包括以学习和研究为目的），均需仔细阅读本协议，在理解、同意、并遵守本协议的全部条款后，方可开始使用 123PHPSHOP 软件。
本授权协议适用且仅适用于 123PHPSHOP 1.x.x 版本，上海序程信息科技有限公司拥有对本授权协议的最终解释权。
I. 协议许可的权利
1. 您可以在完全遵守本最终用户授权协议的基础上，将本软件应用于商业用途或非商业用途，但必须保留源码中的版权声明。 
2. 您可以在协议规定的约束和限制范围内修改 123PHPSHOP 源代码(如果被提供的话)或界面风格以适应您的网站要求。 
3. 您拥有使用本软件构建的商店中全部会员资料、文章、商品及相关信息的所有权，并独立承担与其内容的相关法律义务。 
4. 获得企业服务之后，上海序程信息科技有限公司会根据您所购买的服务类型中确定的技术支持期限、技术支持方式和技术支持内容，自服务起始时刻起，在技术支持期限内拥有通过指定的方式获得指定范围内的技术支持服务。企业服务用户享有反映和提出意见的权力，相关意见将被作为首要考虑，但没有一定被采纳的承诺或保证。 
II. 协议规定的约束和限制
1. 在获得上海序程信息科技有限公司书面授权之前，不得修改代码中的版权信息。 
2. 无论如何，即无论用途如何、是否经过修改或美化、修改程度如何，只要使用 123PHPSHOP 的整体或任何部分，未经书面许可，网站页面页脚处的 123PHPSHOP 名称和上海序程信息科技有限公司下属网站(http://www.123PHPSHOP.com) 的链接都必须保留，而不能清除或修改。
3. 如果您未能遵守本协议的条款，您的授权将被终止，所被许可的权利将被收回，并承担相应法律责任。 
III. 有限担保和免责声明
1. 本软件及所附带的文件是作为不提供任何明确的或隐含的赔偿或担保的形式提供的。 
2. 用户出于自愿而使用本软件，您必须了解使用本软件的风险，在尚未购买企业技术服务之前，我们不承诺提供任何形式的技术支持、使用担保，也不承担任何因使用本软件而产生问题的相关责任。 
3. 上海序程信息科技有限公司不对使用本软件构建的商店中的文章或信息承担责任，但在不侵犯用户隐私信息的前提下，保留以任何方式获取用户及商品信息的权利。 
有关 123PHPSHOP! 最终用户授权协议、商业授权与技术服务的详细内容，均由 123PHPSHOP 官方网站独家提供。 上海序程信息科技有限公司拥有在不事先通知的情况下，修改授权协议和服务价目表的权力，修改后的协议或价目表对自改变之日起的新授权用户生效。 电子文本形式的授权协议如同双方书面签署的协议一样，具有完全的和等同的法律效力。您一旦开始安装 123PHPSHOP，即被视为完全理解并接受本协议的各项条款，在享有上述条款授予的权力的同时， 受到相关的约束和限制。协议许可范围以外的行为，将直接违反本授权协议并构成侵权，我们有权随时终止授权，责令停止损害，并保留追究相关责任的权力。
上海序程信息科技有限公司
</textarea>
    </label>
  </p>
  <p>
    <label>
    <div align="center">
      <input name="Submit" type="submit" value="我同意此安装协议" />
    </div>
    </label>
  </p>
  <p align="left">&nbsp;</p>
  <p>&nbsp;</p>
</form>
</body>
</html>
