<?php
/**
 * Created by PhpStorm.
 * User: Yuri2
 * Date: 2016/12/1
 * Time: 21:21
 */

//SysNaples下的配置文件，覆盖全局配置
return [
    //基础设置
    'debug'=>true, //debug模式
    'doc_check'=>true,//是否开启注释解析引擎
    'log_visitor'=>false,//记录访问者信息到日志
    //-----------------------------------------------------
    //服务器设置
    'enable_ini_set'=>true,
    //-----------------------------------------------------
    //路由设置
    'bind_follow_order'=>true,//按顺序绑定路由参数？否则按键值对绑定
    //-----------------------------------------------------
    //控制器设置
    //-----------------------------------------------------
];