<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | Trace设置 开启 app_trace 后 有效
// +----------------------------------------------------------------------
return [
    // 验证码字符集合
    'codeSet'  => '2345678abcdefhijkmnpqrstuvwxyzABCDEFGHJKLMNPQRTUVWXY', 
    // 验证码字体大小(px)
    'fontSize' => 25, 
    // 是否画混淆曲线
    'useCurve' => true, 
     // 验证码图片高度
    'imageH'   => 60,
    // 验证码图片宽度
    'imageW'   => 200, 
    // 验证码位数
    'length'   => 4, 
    // 验证成功后是否重置        
    'reset'    => true
];
