Repository: imfht/phpsourcecode
Catalog: ngo/os/typo3conf/l10n/ch/setup/Resources/Private/Language/ch.locallang.xlf
Languages: ch

source: User Settings
ch: 用户设置

source: Admin functions
ch: 管理功能

# beUser_avatar
source: Avatar
ch: 头像

# beUser_email
source: Your email address
ch: 你的邮件地址

# beUser_realName
source: Your name
ch: 你的名字

# debugInWindow
source: Display debug messages in a new browser window
ch: 在新窗口中显示错误信息

source: Default
ch: 默认

# editFunctionsTab
source: Edit & Advanced functions
ch: 编辑 &高级功能

# edit_RTE
source: Enable Rich Text Editor (if available)
ch: 开启富文本编辑器（如果有）

# edit_docModuleUpload
source: File upload directly in Doc-module
ch: 文件直接在文档模块中上传

# edit_functions
source: Edit
ch: 编辑

# edit_showFieldHelp
source: Context Sensitive Help mode
ch: 上下文敏感帮助模式

# edit_showFieldHelp_icon
source: Display help icon only
ch: 仅用图标显示帮助

# edit_showFieldHelp_message
source: Display full text message
ch: 显示全文信息

# edit_showFieldHelp_none
source: Display no help information
ch: 不显示帮助信息

# edit_wideDocument
source: Wide document background
ch: 宽文档背景

# emailMeAtLogin
source: Notify me by email, when somebody logs in <br />from my account
ch: 当有人使用我的账户登录时，请用邮件提醒我。

# enableFlashUploader
source: Enable Flash Uploader (requires Flash 9+)
ch: 开启FLASH上传工具（需要Flash 9+）

# enableInstallTool.createFile
source: Create Install Tool Enable File
ch: 创建安装工具开启文件

# enableInstallTool.deleteFile
source: Delete Install Tool Enable File
ch: 删除安装工具开启文件

# enableInstallTool.file
source: Install Tool Enable file
ch: 安装工具开启文件

# enableInstallTool.fileCreate_failed
source: The Install Tool Enable file could not be created.
ch: 安装工具开启文件不能被创建。

# enableInstallTool.fileCreate_ok
source: The Install Tool Enable file has been created.
ch: 安装工具开启文件已经被创建。

# enableInstallTool.fileDelete_failed
source: The Install Tool Enable file could not be deleted!
ch: 安装工具开启文件不能被删除

# enableInstallTool.fileDelete_ok
source: The Install Tool Enable file has been deleted.
ch: 安装工具开启文件已经被删除

# enableInstallTool.fileHasKeep
source: The Install Tool file has the content "KEEP_FILE" and can not be deleted!
ch: 安装工具开启文件有“KEEP_FILE”内容，不能被删除。

# enableInstallTool.label
source: Install Tool Access
ch: 安装工具访问

# flexibleTextareas_MaxHeight
source: Maximal Height of flexible Textareas in Pixel
ch: 灵活文本区的最大高度（像素）

# functions
source: Advanced functions
ch: 高级功能

# lang_ch
source: Chinese (Simple)
ch: 中文（简体）

# lang_default
source: English
ch: 英语

source: Language
ch: 语言

source: levels
ch: 级别

# maxTitleLen
source: Max. Title Length
ch: 最大，标题长度

source: New password
ch: 新密码

source: New password, again
ch: 再次输入新密码

# newPassword_failed
source: Password was NOT updated because you didn't enter the same password twice.
ch: 密码没有更新因为你输入了相同的密码两次。

# newPassword_ok
source: Password was updated.
ch: 密码已经更新

# noMenuMode
source: Select navigation mode
ch: 选择导航模式

# oldPassword_failed
source: Password was NOT updated because you didn't enter the correct current password.
ch: 密码没有更新因为你没有输入正确的当前密码

# opening
source: Startup
ch: 开始

# passwordCurrent
source: Current password
ch: 当前密码

# passwordHeader
source: Password
ch: 密码

source: Personal data
ch: 个人数据

# resetConfiguration
source: Reset Configuration and Clear Temporary Data
ch: 重置配置并且清除临时数据

# resetConfigurationButton
source: Reset user settings to default state
ch: 重置用户设置到默认状态

# resetSectionHeader
source: Reset Settings
ch: 重置设置

# resizeTextareas
source: Make Textareas resizable
ch: 使编辑器尺寸可变

# resizeTextareas_Flexible
source: Make Textareas flexible
ch: 使编辑器更灵活

# resizeTextareas_MaxHeight
source: Maximal Height of resizable Textarea in Pixel
ch: 以像素可变文本区的最大高度

# save
source: Save Configuration
ch: 保存配置

# setToStandard
source: Reset all Values to default
ch: 重置所有值为默认

# setToStandardQuestion
source: Are you sure you want to reset all values to default?
ch: 你确认你想重置所有值到默认

# settingsAreReset
source: The user settings have been reset to default values and temporary data has been cleared.
ch: 用户设置已经被重置到默认值，临时文件已经被清除

# setupWasUpdated
source: User settings were updated.
ch: 用户设置已经更新

# showHiddenFilesAndFolders
source: Show hidden files and folders in the filelist
ch: 在文件列表中显示隐藏的文件和文件夹

# showThumbs
source: Show Thumbnails by default
ch: 按默认设置显示缩略图

# simulate
source: Simulate backend user
ch: 模拟后台用户

# startModule
source: Start up in the following module
ch: 进入系统后显示如下的模块

# startModule.firstInMenu
source: - First module in menu -
ch: - 菜单中的第一个模块 -
