<?php
// +----------------------------------------------------------------------
// | RXThink框架 [ RXThink ]
// +----------------------------------------------------------------------
// | 版权所有 2017~2019 南京RXThink工作室
// +----------------------------------------------------------------------
// | 官方网站: http://www.rxthink.cn
// +----------------------------------------------------------------------
// | Author: 牧羊人 <rxthink@gmail.com>
// +----------------------------------------------------------------------

// [ 应用入口文件 ]

// 定义应用目录
define('APP_PATH', __DIR__ . '/../application/');

// 自定义配置文件目录
define('CONF_PATH', __DIR__ . '/../config/');

// 自定义扩展文件目录
define('EXTEND_PATH', __DIR__ . '/../extend/');

// 绑定模块
define('BIND_MODULE', 'admin');

// 加载框架引导文件
require __DIR__ . '/../thinkphp/start.php';

// // 读取自动生成定义文件
// $build = include '/../build.php';
// // 运行自动生成
// \think\Build::run($build,'app',true);
