<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 日志设置
// +----------------------------------------------------------------------
//return [
//    // 日志记录方式，内置 file socket 支持扩展
//    'type'        => 'File',
//    // 日志保存目录
//    'path'        => '',
//    // 日志记录级别
//    'level'       => [],
//    // 单文件日志写入
//    'single'      => false,
//    // 独立日志级别
//    'apart_level' => [],
//    // 最大日志文件数量
//    'max_files'   => 0,
//    // 是否关闭日志写入
//    'close'       => false,
//];
return [
    // 日志记录方式，内置 file socket 支持扩展
    'type'        => Env::get('log_type', 'file'),
    // 日志保存目录
    'path'        => '',
    // 日志记录级别
    'level'       => [],
    // 单文件日志写入
    'single'      => false,
    // 独立日志级别
    'apart_level' => [],
    // 最大日志文件数量
    'max_files'   => 0,
    // 是否关闭日志写入
    'close'       => false,

    'host'=>Env::get('log_host', 'localhost'),
    //日志强制记录到配置的client_id
    'force_client_ids'    => [Env::get('log_client_id')],
    //限制允许读取日志的client_id
    'allow_client_ids'    => [Env::get('log_client_id')],
];