<div class="message" style="text-align: left; width: 95%; margin: auto;">
	<h2>1. Xiuno BBS 2.0 中文版授权协议</h2>
	
	<p>感谢您选择 Xiuno BBS，Xiuno BBS 是一套面向千万级数据量设计，同时支持SQL、NoSQL(MySQL, pdo_*, MongoDB)存储和各类 Cache (Memcached, TTServer, Redis...)的高负载论坛程序，是大型站点(日PV 100w+)的一个比较好的选择。</p>
	
	<p>版权所有 (c)2010，xiuno.com</p>
	
	<p>Xiuno 发音“修罗”，英文为 Shura，在佛教里面为六道之一"修罗道"，处于人道和天道之间。 </p>
	
	<p>本授权协议适用于 Xiuno BBS 2.0 版本，xiuno.com 有最终解释权。</p>
	
	<h3>I. 协议许可的权利</h3>
	<ol>
	<li>您可以在完全遵守本最终用户授权协议的基础上，将本软件应用于非商业用途，而不必支付软件版权授权费用。</li>
	<li>您可以在协议规定的约束和限制范围内修改 Xiuno 源代码(如果被提供的话)或界面风格以适应您的网站要求。</li>
	<li>您拥有使用本软件构建的论坛中全部会员资料、文章及相关信息的所有权，并独立承担与文章内容的相关法律义务。</li>
	<li>获得商业授权之后，您可以将本软件应用于商业用途，同时依据所购买的授权类型中确定的技术支持期限、技术支持方式和技术支持内容，自购买时刻起，在技术支持期限内拥有通过指定的方式获得指定范围内的技术支持服务。商业授权用户享有反映和提出意见的权力，相关意见将被作为首要考虑，但没有一定被采纳的承诺或保证。</li>
	</ol>
	
	<h3>II. 协议规定的约束和限制</h3>
	<ol>
	<li>未获商业授权之前，不得将本软件用于商业用途（包括但不限于企业网站、经营性网站、以营利为目或实现盈利的网站）。购买商业授权请登陆 http://www.xiuno.com 参考相关说明。</li>
	<li>不得对本软件或与之关联的商业授权进行出租、出售、抵押或发放子许可证。</li>
	<li>未获商业授权之前，页面页脚处的 Xiuno BBS 名称和链接都必须保留。</li>
	<li>对 Xiuno BBS 的代码修改（非删除和增加）不超过30%，您可以派发衍生版本，但页脚需要带有 based on Xiuno BBS 的字样和链接。</li>
	<li>对 Xiuno BBS 的代码修改（非删除和增加）超过 30%，您可以派发全新版本，版权归您所有。</li>
	<li>如果您未能遵守本协议的条款，您的授权将被终止，所被许可的权利将被收回，并承担相应法律责任。</li>
	</ol>
	
	<h3>III. 有限担保和免责声明</h3>
	<ol>
	<li>本软件及所附带的文件是作为不提供任何明确的或隐含的赔偿或担保的形式提供的。</li>
	<li>用户出于自愿而使用本软件，您必须了解使用本软件的风险，在尚未购买产品技术服务之前，我们不承诺提供任何形式的技术支持、使用担保，也不承担任何因使用本软件而产生问题的相关责任。</li>
	</ol>
	
	<p>电子文本形式的授权协议如同双方书面签署的协议一样，具有完全的和等同的法律效力。您一旦开始安装 Xiuno，即被视为完全理解并接受本协议的各项条款，在享有上述条款授予的权力的同时，受到相关的约束和限制。协议许可范围以外的行为，将直接违反本授权协议并构成侵权，我们有权随时终止授权，责令停止损害，并保留追究相关责任的权力。</p>
	
	<p>协议发布时间：2012年3月2日</p>
</div>
<div style="text-align:center;">
	<input type="button" value="我不同意" onclick="window.close();" />
	&nbsp;&nbsp;&nbsp;
	<input type="button" value="我同意" onclick="window.location='index.php?step=checkenv'"/>
</div>