{
  "locale": "en",
  "lang": "English",
  "data": [
    {
      "key": "browser-reject-desc",
      "val": "This Application are not fully supported in this browser/version"
    },
    {
      "key": "browser-reject-advice-desc",
      "val": "Please download the Google Chrome, and Install or Upgrade to the latest version"
    },
    {
      "key": "browser-dev-wait-desc",
      "val": "We are developing to support the following browsers in the future, please wait"
    },
    {
      "key": "editor-autocomplete-desc",
      "val": "Currently only support the <strong>Javascript</strong>. <br />Other languages are working to develop, pls wait"
    },
    {
      "key": "plugins-php-yaf-mvc-desc",
      "val": "Develop a browser / server-side Web applications based on PHP Yaf Framework"
    },
    {
      "key": "rt-php-desc",
      "val": "Fast, flexible and pragmatic, PHP powers everything from your blog to the largest social networking site in the world"
    },
    {
      "key": "rt-php-desc2",
      "val": "PHP is a popular general-purpose scripting language that is especially suited to web development"
    },
    {
      "key": "rt-go-desc",
      "val": "Go is an open source programming environment that makes it easy to build simple, reliable, and efficient software"
    },
    {
      "key": "rt-go-desc2",
      "val": "in lessCreator environment, you can use the WebTerminal debug Go. Its default path is ~/runtime/gopath"
    },
    {
      "key": "rt-nodejs-desc",
      "val": "Node.js is a platform built on Chrome's JavaScript runtime for easily building fast, scalable network applications"
    },
    {
      "key": "rt-nodejs-desc2",
      "val": "in lessCreator environment, you can use the WebTerminal debug NodeJS. Its default path is ~/runtime/nodejs"
    },
    {
      "key": "rt-quickstart-fsinit-desc",
      "val": "This Wizard will create a default directory structure and initial configuration files. The following files will be overwritten"
    },
    {
      "key": "plugins-go-beego-mvc-desc",
      "val": "Beego is an open-source framework to quickly build and develop Go web applications"
    },
    {
      "key": "rt-nginx-desc",
      "val": "Nginx is a lightweight, high concurrency, high performance and low memory usage Web server/reverse proxy"
    },
    {
      "key": "op-commit-wait-desc",
      "val": "Your operation has been submitted, the task is processing, please wait"
    },
    {
      "key": "beego-install-desc",
      "val": "Depending on your network, the installation process will take up 2 to 15 minutes"
    }
  ]
}

