<?php
// +----------------------------------------------------------------------
// | RXThinkCMF框架 [ RXThinkCMF ]
// +----------------------------------------------------------------------
// | 版权所有 2017~2020 南京RXThinkCMF研发中心
// +----------------------------------------------------------------------
// | 官方网站: http://www.rxthink.cn
// +----------------------------------------------------------------------
// | Author: 牧羊人 <1175401194@qq.com>
// +----------------------------------------------------------------------

return [
    'session' => [
        'prefix' => 'think_',
        'auto_start' => true
    ],
    'product_name' => 'RXThinkCMF', //产品名称
    'company_website_domain' => 'http://www.rxthink.cn', //官方网址
    'website_domain' => 'http://www.rxthink.cn', //产品网址
    'company_name' => '南京RXThink工作室', //公司名称
    'original_table_prefix' => 'think_', //默认表前缀
];
